import"../chunks/CWj6FrbW.js";import"../chunks/69_IOA4Y.js";import{f as m,a,b as i,n as p}from"../chunks/Dqb1_Hg5.js";import{T as e}from"../chunks/DCfYLLLG.js";/* empty css                *//* empty css                */import"../chunks/C2dv2nOL.js";/* empty css                */var n=m(`<!> Метод Гаусса: Алгоритм, ведущие элементы, устойчивость (выбор главного элемента).

LU-разложение: Теория, построение, использование для решения систем. Связь с методом Гаусса.

Структура решения: Общее решение однородной и неоднородной системы.

Определитель: Определение, свойства, геометрический смысл (ориентированный объем). Теорема Крамера.

Обратная матрица: Алгоритмы вычисления (через LU, методом Жордана-Гаусса).

Переопределенные и недоопределенные системы: Понятие псевдообратной матрицы Мура-Пенроуза. Метод наименьших квадратов.`,1);function h(o){var t=n(),r=a(t);e(r,{title:"Системы линейных уравнений"}),p(),i(o,t)}export{h as component};
