import"../chunks/CWj6FrbW.js";import"../chunks/69_IOA4Y.js";import{f as a,a as m,b as i,n as p}from"../chunks/BWp35gWV.js";import{T as e}from"../chunks/CR7k0xtG.js";/* empty css                *//* empty css                */import"../chunks/C2dv2nOL.js";/* empty css                */var n=a(`<!> Собственные значения и векторы: Определение, нахождение (характеристический полином).

Спектральная теорема для самосопряженных операторов: Диагонализация симметричных и эрмитовых матриц ортогональными/унитарными матрицами.

Жорданова нормальная форма: Общий случай недиагонализируемых матриц.

Степени и функции от матриц: Вычисление через спектральное разложение.

Приложения: Анализ динамических систем, алгоритм PageRank.`,1);function h(o){var t=n(),r=m(t);e(r,{title:"Собственные значения"}),p(),i(o,t)}export{h as component};
