import"../chunks/CWj6FrbW.js";import"../chunks/69_IOA4Y.js";import{f as m,a,b as i,n as p}from"../chunks/BWp35gWV.js";import{T as e}from"../chunks/CR7k0xtG.js";/* empty css                *//* empty css                */import"../chunks/C2dv2nOL.js";/* empty css                */var n=m(`<!> Скалярное произведение: Аксиомы. Примеры: стандартное, взвешенное, в пространствах функций.

Длина (норма) и угол. Неравенство Коши-Буняковского. Неравенство треугольника.

Ортогональность и ортонормированные базисы. Процесс ортогонализации Грама-Шмидта (алгоритм, устойчивость, модификации).

QR-разложение: Теория и алгоритмы (Грама-Шмидта, отражения Хаусхолдера, вращения Гивенса). Применение для решения СЛУ.

Изометрии: Ортогональные и унитарные матрицы. Их свойства.`,1);function h(o){var t=n(),r=a(t);e(r,{title:"Скалярное произведение"}),p(),i(o,t)}export{h as component};
