import"../chunks/CWj6FrbW.js";import"../chunks/69_IOA4Y.js";import{f as v,a as $,b as o,s as r,n as _,t as q,c as w,r as B}from"../chunks/BWp35gWV.js";import{H as j}from"../chunks/DXKx2xvL.js";import{P as c}from"../chunks/B7flgP-x.js";import{M as a}from"../chunks/BqyEoRxA.js";import{T as ra}from"../chunks/CR7k0xtG.js";import{D as H}from"../chunks/DlTIf4aM.js";import{P as X}from"../chunks/DPzc5wQr.js";import"../chunks/i9XClpbl.js";/* empty css                */import{T as S}from"../chunks/y0AHHn4v.js";import{P as R}from"../chunks/BBkyo9uE.js";import{F as Ur}from"../chunks/LJLd6mQS.js";import{S as Vr}from"../chunks/CBbFRhrb.js";var aa=v("<b>Цепная дробь</b> &mdash; дробь вида",1),_a=v("<!> <!> <!> <!>",1),oa=v("Первостепенный интерес для нас будут представлять только те цепные дроби, в которых все <!> равны единице. Для удобства записи введем обозначение",1),na=v("Если <!>, символ <!> принимается равным нулю.",1),ea=v("<!> <!> <!> <!> <!>",1),da=v("<i>Kettenbruch</i> &mdash; цепная дробь",1),ta=v("<!> <!> <!> <!> <!> <!> <!>",1),va=v("Пусть <!> &mdash; целое число.",1),sa=v(`<b>Континуанта</b> &mdash; функция <!>,
    определяемая
    рекуррентным соотношением`,1),la=v("<!> <!> <!>",1),ma=v("Таким образом, <!>, <!>.",1),ia=v("Уже при <!> возникает свободный член 1, который получается при одновременном удалении двух пар <!> и <!>:",1),xa=v(`Для детального анализа структуры рассмотрим случай <!>. Сгруппируем слагаемые полинома по количеству
    вычеркнутых пар <!>:`,1),ca=v("При <!> ни одна пара не вычеркнута, остается полное произведение.",1),$a=v("При <!> вычеркивается одна пара соседних переменных. Например, удаление <!> оставляет хвост <!>.",1),pa=v(`При <!> вычеркиваются две неперекрывающиеся пары. Например, переменная <!> остается
    в одиночестве, если мы удалили пары <!> и <!>.`,1),fa=v("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),ha=v(`В общем случае Л. Эйлер установил, что <!> можно построить чисто комбинаторно,
    не прибегая к рекурсии:`,1),Pa=v("Возьмем полное произведение переменных <!>.",1),ga=v("2. Рассмотрим все возможные способы удалить из него <b>любое количество неперекрывающихся пар соседей</b> <!>.",1),ua=v("Количество слагаемых в этой сумме всегда равно числу Фибоначчи <!>.",1),ba=v("<!> <!> <!> <!>",1),ya=v("Докажем утверждение индукцией по числу переменных <!>.",1),Ka=v(`При <!> левая часть равна <!>,
    а правая часть равна <!>.
    Равенство выполняется.`,1),Aa=v(`Теперь предположим, что формула верна для <!> переменных.
    Рассмотрим выражение для <!> переменных, выделив первое звено дроби:`,1),qa=v("<!> <!> <!> <!>",1),ka=v(`<!>-полиномы симметричны в том смысле, что согласно замечанию Эйлера множество соседних
    пар не меняется при развороте последовательности переменных`,1),Xa=v("И, как следствие, научились выносить чиселку из <!>-полинома:",1),Fa=v("<!> <!> <!> <!>",1),za=v("<!>-полиномы удовлетворяют также обобщённому тождеству Кассини:",1),Ma=v("<!> <!>",1),Ca=v("Разложим первые множители в обоих слагаемых <!> по определению:",1),Ra=v("Слагаемые с <!> сокращаются. Шаг индукции меняет знак выражения на противоположный.",1),Ta=v("<!> <!> <!>",1),ja=v(`Всякое вещественное число <!> в интервале <!> представляется в виде
    правильной цепной дроби, определяемой следующим образом. Положим, что <!>.
    Для всех <!>, таких, что <!>, положим`,1),Da=v("<!> <!>",1),Ha=v(`Если <!>, то величины <!> и <!> не определены и
    правильной цепной дробью для <!> будет <!>.
    Если <!>, данное определение гарантирует, что <!>, так что
    любое <!> будет положительным целым числом.`,1),Sa=v("В частности, если <!>, то <!>.",1),wa=v(`Если <!>, то число <!> всегда лежит между <!> и <!>,
    так как согласно методу вынесения числа из <!>-полинома величина <!> монотонно возрастает от <!> до <!> при возрастании <!> от 0 до 1.
    Согласно определению обобщённой цепной дроби при возрастании <!> цепная дробь будет возрастать
    или убывать в зависимости от того, будет ли число <!> четным или нечетным.`,1),Ba=v("<!> <!> <!> <!> <!> <!> <!>",1),Ea=v(`Поэтому <!> &mdash; <b>экстремально близкое приближение</b> к <!>,
    если <!> не мало. Если <!> не равно нулю для всех <!>, получаем бесконечную
    цепную дробь <!>, значение которой определяется как`,1),Ga=v("из оценки ясно, что этот предел равен <!>.",1),Ia=v("<!> <!> <!> <!> <!>",1),Ja=v("Рассмотрим применение алгоритма к числу, связанному с золотым сечением. Пусть <!>.",1),La=v("Переворачиваем <!>: <!>",1),Na=v("Отрезаем целую часть: <!>",1),Oa=v("Находим новый остаток: <!>",1),Qa=v(`Так как остаток <!> в точности равен исходному числу, процесс зацикливается. Следовательно,
    все коэффициенты <!> будут равны 1. Мы получаем самую красивую и медленно сходящуюся цепную дробь:`,1),Ua=v("<!> <!> <!> <!> <!> <!>",1),Va=v(`Числа <!> называются <i>частичными отношениями</i> числа <!>.
    Обратите внимание на закономерность поведения частичных отношений для чисел <!> и <!>.
    Для чисел же <!>, <!> и <!> никакой видимой
    закономерности в поведении частичных отношений не наблюдается.`,1),Wa=v("<!> <!> <!>",1),Ya=v(`Интересно отметить, что когда древние греки обнаружили существование иррациональных чисел, то, по существу,
    первое определение вещественных чисел они дали в терминах бесконечных цепных дробей.
    Позже они приняли предложение Евдокса вместо этого определить <!> следующим образом:
    “<!> для тех же рациональных чисел <!>, таких, что <!>”.`,1),Za=v(`Если <!> &mdash; рациональное число, то его разложение в правильную цепную дробь естественным образом
    соотносится с алгоритмом Евклида.`,1),r_=v("Для всякого вещественного иррационального алгебраического числа <!> степени <!> существует такое положительное число <!>, что при любых целых <!> и <!>",1),a_=v("<!> <!>",1),__=v(`Пусть <!> является корнем многочлена <!> степени <!> с целыми
    коэффициентами. Как известно из алгебры, мы можем написать:`,1),o_=v("Легко видеть, что <!>.",1),n_=v(`В самом деле, в случае <!> многочлен <!> делился бы без остатка
    на <!>, а значит, многочлен <!> &mdash; на <!>.
    Но в таком случае производная <!> делилась бы на <!>, то есть мы имели
    бы <!>, что невозможно, ибо <!> есть многочлен степени <!> с целыми коэффициентами, а <!> &mdash; алгебраическое число степени <!> оно не может
    быть
    корнем многочлена меньшей степени.`,1),e_=v(`Таким образом, мы имеем <!>, а следовательно, можно найти такое
    положительное число <!>, что`,1),d_=v(`Пусть <!> и <!> (<!>) &mdash; любая пара целых чисел. Если <!>, то <!>, и потому, подставляя в это
    тождество <!>, мы находим:`,1),t_=v(`Числитель последней дроби есть число целое и притом отличное от нуля, так как иначе мы имели бы <!>, в то время как <!> по условиям теоремы число иррациональное.
    Следовательно, этот числитель по меньшей мере равен единице по абсолютному значению.
    Обозначая через <!> верхнюю грань модуля функции <!> в интервале <!>, мы поэтому получаем из последнего неравенства:`,1),v_=v("В случае же, если <!>, мы имеем и подавно:",1),s_=v(`так как <!>, то <!>.
    Обозначая поэтому через <!> любое положительное число, меньшее,
    чем <!> и <!>, мы во всех случаях будем иметь:`,1),l_=v("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),m_=v(`Здесь <!> &mdash; постоянные коэффициенты, а <!> &mdash; степень
    переменной.`,1),i_=v("<!> <!> <!>",1),x_=v(`Подставив это выражение в исходное уравнение, он получил для новой функции <!> уравнение той же самой
    структуры. Выделив из <!> главную часть <!>, он снова сделал обратную
    подстановку для остатка.`,1),c_=v("<!> <!> <!> <!>",1),$_=v(`Чтобы получить разложение для конкретной функции, достаточно найти соответствующее ей дифференциальное уравнение,
    определить параметры <!> и подставить их в этот шаблон.`,1),p_=v("<!> <!>",1),f_=v("<b>1. Степенная функция</b>"),h_=v("Рассмотрим функцию <!>.",1),P_=v("<!> <!>",1),g_=v("Она удовлетворяет уравнению <!>. Приведем его к общему виду:",1),u_=v("<!> <!> <!>",1),b_=v("Это разложение сходится на всей комплексной плоскости с разрезом по лучу <!>.",1),y_=v("<b>2. Логарифм</b>"),K_=v("<!> <!> <!>",1),A_=v("В разложении степенной функции при <!> числители звеньев упрощаются: <!>, <!>, с учетом сокращения на <!> в знаменателе предела, что дает структуру квадратов натуральных чисел:",1),q_=v("<!> <!> <!>",1),k_=v("<b>3. Показательная функция</b>"),X_=v("<!> <!>",1),F_=v(`В разложении степенной функции сделаем замену <!> и перейдем к пределу при <!>.
    Тогда <!>.
    Коэффициенты дроби при этом трансформируются: <!>, <!>.
    Это приводит к знакочередующейся дроби:`,1),z_=v("<b>4. Арктангенс</b>"),M_=v("<!> <!> <!> <!>",1),C_=v(`Функция <!> удовлетворяет уравнению <!>, или <!>.
    Это соответствует параметрам общего уравнения при <!>:`,1),R_=v("<!> <!> <!>",1),T_=v("<b>5. Тангенс</b>"),j_=v("<!> <!>",1),D_=v(`Для <!> дифференциальное уравнение имеет вид <!>.
    Здесь <!> (если перенести <!> влево: <!>).
    Подстановка параметров в «конструктор» Лагранжа порождает знаменитую дробь Ламберта:`,1),H_=v(`Напомним, что <b>гипергеометрические функции</b> &mdash; это широкий класс специальных функций, задаваемых
    степенными рядами,
    коэффициенты которых зависят от набора параметров. Наиболее важным частным случаем является <b>функция Гаусса</b> <!>, к которой сводятся многие элементарные функции.`,1),S_=v("<b>Алгоритм построения</b>"),w_=v(`Пусть последовательность функций <!> удовлетворяет линейному рекуррентному
    соотношению:`,1),B_=v("Разделим обе части уравнения на <!>. Это позволяет выразить отношение соседних функций:",1),E_=v(`Применяя это равенство последовательно для <!>, мы разворачиваем отношение первых двух
    функций в бесконечную цепную дробь. В компактной нотации Гаусса это записывается через оператор <!>:`,1),G_=v("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),I_=v("<b>1. Функция <!> (Связь с функцией Бесселя)</b>"),J_=v("Для функции <!> известно рекуррентное соотношение:",1),L_=v("Подставляя <!> в общий алгоритм, получаем разложение:",1),N_=v("<!> <!> <!> <!> <!>",1),O_=v("<b>2. Функция <!> (Вырожденная, связь с экспонентой)</b>"),Q_=v(`Для вырожденной функции используются два чередующихся тождества, связывающих параметры <!> и <!>.
    Это приводит к дроби с коэффициентами:`,1),U_=v("где числители звеньев <!> зависят от шага <!>: <!>, <!>.",1),V_=v("<!> <!> <!> <!>",1),W_=v("<b>3. Функция Гаусса <!></b>"),Y_=v("Здесь коэффициенты <!> имеют сложную структуру, чередующуюся для четных и нечетных звеньев:",1),Z_=v("<!> <!> <!> <!> <!>",1),ro=v("<b>1. Арктангенс</b>"),ao=v("Разложение получается из представления арктангенса через ряд Гаусса <!>.",1),_o=v("<!> <!> <!>",1),oo=v("Применяя общую формулу с параметрами <!>, получаем быстро сходящуюся дробь:",1),no=v("<!> <!>",1),eo=v("<b>2. Экспонента</b>"),to=v("Экспонента связана с вырожденной гипергеометрической функцией <!>.",1),vo=v("<!> <!>",1),so=v(`Используя предельный переход в формуле Гаусса (при <!>), мы получаем разложение с простыми
    коэффициентами:`,1),lo=v("<!> <!>",1),mo=v("<b>3. Тангенс</b>"),io=v("Это исторически первый пример (Ламберт, 1768). Тангенс выражается через отношение функций Бесселя (<!>).",1),xo=v("<!> <!>",1),co=v("<!> <!>",1),$o=v("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1);function Mo(Wr){var E=$o(),G=$(E);ra(G,{title:"Цепные дроби"});var I=r(G,2);H(I,{title:"Цепная дробь",children:(x,P)=>{var n=_a(),s=$(n);c(s,{children:(d,e)=>{var l=aa();_(),o(d,l)}});var t=r(s,2);a(t,{display:!0,m:`\\cfrac{b_1}{a_1 +
          \\cfrac{b_2}{a_2 +
          \\cfrac{b_3}{\\ddots +
          \\cfrac{b_n}{a_n
          }}}} = \\kcont_{k=1}^n \\frac{b_k}{a_k}`});var m=r(t,2);c(m,{children:(d,e)=>{_();var l=q("Цепная дробь также может быть и бесконечной.");o(d,l)}});var p=r(m,2);a(p,{display:!0,m:`\\cfrac{b_1}{a_1 +
          \\cfrac{b_2}{a_2 +
          \\cfrac{b_3}{a_3 + \\dotsb
          }}} = \\kcont_{k=1}^\\oo \\frac{b_k}{a_k}`}),o(x,n)}});var J=r(I,2);X(J,{children:(x,P)=>{var n=ea(),s=$(n);c(s,{children:(e,l)=>{_();var i=oa(),f=r($(i));a(f,{m:"b"}),_(),o(e,i)}});var t=r(s,2);a(t,{display:!0,m:"\\/ x_1, x_2, \\dots, x_n \\/ = 1/(x_1 + 1/(x_2 + 1/(\\dots (x_{n-1} + 1/x_n) \\dots)))"});var m=r(t,2);c(m,{children:(e,l)=>{_();var i=q("Тогда, к примеру,");o(e,i)}});var p=r(m,2);a(p,{display:!0,m:`\\align{
          \\/ x_1 \\/ &= \\frac{1}{x_1}, \\\\
          \\/ x_1, x_2 \\/ &= \\frac{1}{x_1 + 1/x_2} = \\frac{x_2}{x_1 x_2 + 1}.
          }`});var d=r(p,2);c(d,{children:(e,l)=>{_();var i=na(),f=r($(i));a(f,{m:"n=0"});var h=r(f,2);a(h,{m:"\\/ x_1, \\dots, x_n \\/"}),_(),o(e,i)}}),o(x,n)}});var L=r(J,2);H(L,{title:"Оператор K",children:(x,P)=>{var n=ta(),s=$(n);c(s,{children:(i,f)=>{_();var h=q("Запись вида");o(i,h)}});var t=r(s,2);a(t,{display:!0,m:`
        X = 1 + \\kcont_{n=1}^\\infty \\frac{a_n}{b_n}
    `});var m=r(t,2);c(m,{children:(i,f)=>{_();var h=q("является сокращением для развернутой «лестницы»:");o(i,h)}});var p=r(m,2);a(p,{display:!0,m:`
        X = 1 + \\frac{k_1 x}{1 + \\frac{k_2 x}{1 + \\frac{k_3 x}{1 + \\dots}}}
    `});var d=r(p,2);c(d,{children:(i,f)=>{_();var h=q("В линейной строчной записи это эквивалентно:");o(i,h)}});var e=r(d,2);a(e,{display:!0,m:`
        X = 1 + \\frac{k_1 x}{1+} \\frac{k_2 x}{1+} \\frac{k_3 x}{1+} \\frac{k_4 x}{1+} \\cdots
    `});var l=r(e,2);c(l,{children:(i,f)=>{var h=da();_(),o(i,h)}}),o(x,n)}});var N=r(L,2);H(N,{title:"Континуанты",children:(x,P)=>{var n=la(),s=$(n);c(s,{children:(p,d)=>{_();var e=va(),l=r($(e));a(l,{m:"n \\ge 0"}),_(),o(p,e)}});var t=r(s,2);c(t,{children:(p,d)=>{var e=sa(),l=r($(e),2);a(l,{m:"K_n: \\RR^n \\to \\RR"}),_(),o(p,e)}});var m=r(t,2);a(m,{display:!0,m:`
        K_n(x_1, \\dots, x_n) \\defeq \\cases{
            1 & \\if n = 0 \\\\
            x_1 & \\if n = 1 \\\\
            x_1\\cdot K_{n-1}(x_2, \\dots, x_n) + K_{n-2}(x_3, \\dots, x_n) & \\otherwise
        }
    `}),o(x,n)}});var O=r(N,2);X(O,{children:(x,P)=>{var n=fa(),s=$(n);c(s,{children:(g,K)=>{_();var u=ma(),b=r($(u));a(b,{m:"K_2(x_1, x_2) = x_1 x_2 + 1"});var F=r(b,2);a(F,{m:"K_3(x_1, x_2, x_3) = x_1 x_2 x_3 + x_1 + x_3"}),_(),o(g,u)}});var t=r(s,2);c(t,{children:(g,K)=>{_();var u=q(`С ростом числа переменных закономерность усложняется: появляются слагаемые, полученные вычеркиванием нескольких
    несмежных пар одновременно.`);o(g,u)}});var m=r(t,2);c(m,{children:(g,K)=>{_();var u=ia(),b=r($(u));a(b,{m:"n=4"});var F=r(b,2);a(F,{m:"x_1 x_2"});var A=r(F,2);a(A,{m:"x_3 x_4"}),_(),o(g,u)}});var p=r(m,2);a(p,{display:!0,m:`
        K_4(x_1, x_2, x_3, x_4) = x_1 x_2 x_3 x_4 + (x_3 x_4 + x_1 x_4 + x_1 x_2) + 1.
    `});var d=r(p,2);c(d,{children:(g,K)=>{_();var u=xa(),b=r($(u));a(b,{m:"n=5"});var F=r(b,2);a(F,{m:"k"}),_(),o(g,u)}});var e=r(d,2);a(e,{display:!0,m:`
        K_5(x_1, \\dots, x_5) = \\underbrace{x_1 x_2 x_3 x_4 x_5}_{k=0}
        + \\underbrace{(x_3 x_4 x_5 + \\dots + x_1 x_2 x_3)}_{k=1}
        + \\underbrace{(x_5 + x_3 + x_1)}_{k=2}.
    `});var l=r(e,2);c(l,{children:(g,K)=>{_();var u=q("Логика формирования групп следующая:");o(g,u)}});var i=r(l,2);c(i,{children:(g,K)=>{_();var u=ca(),b=r($(u));a(b,{m:"k=0"}),_(),o(g,u)}});var f=r(i,2);c(f,{children:(g,K)=>{_();var u=$a(),b=r($(u));a(b,{m:"k=1"});var F=r(b,2);a(F,{m:"x_1 x_2"});var A=r(F,2);a(A,{m:"x_3 x_4 x_5"}),_(),o(g,u)}});var h=r(f,2);c(h,{children:(g,K)=>{_();var u=pa(),b=r($(u));a(b,{m:"k=2"});var F=r(b,2);a(F,{m:"x_5"});var A=r(F,2);a(A,{m:"x_1 x_2"});var k=r(A,2);a(k,{m:"x_3 x_4"}),_(),o(g,u)}});var y=r(h,2);c(y,{children:(g,K)=>{_();var u=q("Подсчет количества таких комбинаций приводит нас к важному комбинаторному обобщению.");o(g,u)}}),o(x,n)}});var Q=r(O,2);X(Q,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=ha(),m=r($(t));a(m,{m:"K_n(x_1, \\dots, x_n)"}),_(),o(n,t)}})}});var U=r(Q,2);X(U,{children:(x,P)=>{var n=ba(),s=$(n);c(s,{children:(d,e)=>{_();var l=Pa(),i=r($(l));a(i,{m:"x_1 x_2 \\dots x_n"}),_(),o(d,l)}});var t=r(s,2);c(t,{children:(d,e)=>{_();var l=ga(),i=r($(l),3);a(i,{m:"x_j x_{j+1}"}),_(),o(d,l)}});var m=r(t,2);c(m,{children:(d,e)=>{_();var l=q("3. Сумма всех полученных таким образом остатков и есть искомый полином.");o(d,l)}});var p=r(m,2);c(p,{children:(d,e)=>{_();var l=ua(),i=r($(l));a(i,{m:"F_{n+1}"}),_(),o(d,l)}}),o(x,n)}});var V=r(U,2);S(V,{title:"Основное свойство континуант",children:(x,P)=>{a(x,{display:!0,m:`\\/ x_1, x_2, \\dots, x_n \\/
          = \\frac{K_{n-1}(x_2, \\dots, x_n)}{K_n(x_1, x_2, \\dots, x_n)} \\quad\\text{при}~ n \\ge 1`})}});var W=r(V,2);R(W,{children:(x,P)=>{var n=qa(),s=$(n);c(s,{children:(d,e)=>{_();var l=ya(),i=r($(l));a(i,{m:"n"}),_(),o(d,l)}});var t=r(s,2);c(t,{children:(d,e)=>{_();var l=Ka(),i=r($(l));a(i,{m:"n=1"});var f=r(i,2);a(f,{m:"\\/ x_1 \\/ = 1/x_1"});var h=r(f,2);a(h,{m:"K_0 / K_1(x_1) = 1/x_1"}),_(),o(d,l)}});var m=r(t,2);c(m,{children:(d,e)=>{_();var l=Aa(),i=r($(l));a(i,{m:"n-1"});var f=r(i,2);a(f,{m:"n"}),_(),o(d,l)}});var p=r(m,2);a(p,{display:!0,m:`\\align{
          \\/ x_1, \\dots, x_n \\/
          &= \\frac{1}{x_1 + \\/ x_2, \\dots, x_n \\/}
          = \\frac{1}{x_1 + K_{n-2}(x_3, \\dots, x_n) / K_{n-1}(x_2, \\dots, x_n)} \\\\!!
          &= \\frac{K_{n-1}(x_2, \\dots, x_n)}{x_1 \\cdot K_{n-1}(x_2, \\dots, x_n) + K_{n-2}(x_3, \\dots, x_n)}
          = \\frac{K_{n-1}(x_2, \\dots, x_n)}{K_n(x_1, \\dots, x_n)}
          }`}),o(x,n)}});var Y=r(W,2);X(Y,{children:(x,P)=>{var n=Fa(),s=$(n);c(s,{children:(d,e)=>{var l=ka(),i=$(l);a(i,{m:"K"}),_(),o(d,l)}});var t=r(s,2);a(t,{display:!0,m:`
        K_n(x_1, x_2, \\dots, x_n) = K_n(x_n, \\dots, x_2, x_1)
    `});var m=r(t,2);c(m,{children:(d,e)=>{_();var l=Xa(),i=r($(l));a(i,{m:"K"}),_(),o(d,l)}});var p=r(m,2);a(p,{display:!0,m:`
        K_n(x_1, \\dots, x_n) = x_n K_{n-1}(x_1, \\dots, x_{n-1}) + K_{n-2}(x_1, \\dots, x_{n-2}) \\quad \\text {при } n > 1
    `}),o(x,n)}});var Z=r(Y,2);S(Z,{title:"Тождество Кассини для континуант",children:(x,P)=>{var n=Ma(),s=$(n);c(s,{children:(m,p)=>{var d=za(),e=$(d);a(e,{m:"K"}),_(),o(m,d)}});var t=r(s,2);a(t,{display:!0,m:`
        K_n(x_1, \\dots, x_n) K_n(x_2, \\dots, x_{n+1}) - K_{n+1}(x_1, \\dots, x_{n+1}) K_{n-1}(x_2, \\dots, x_n)
        = (-1)^n \\quad \\text {при } n \\ge 1
    `}),o(x,n)}});var rr=r(Z,2);R(rr,{children:(x,P)=>{var n=Ta(),s=$(n);c(s,{children:(p,d)=>{_();var e=Ca(),l=r($(e));a(l,{m:"x_1"}),_(),o(p,e)}});var t=r(s,2);a(t,{display:!0,m:`
        \\align{
            &K_n(x_1, \\dots, x_n) K_n(x_2, \\dots, x_{n+1}) - K_{n+1}(x_1, \\dots, x_{n+1}) K_{n-1}(x_2, \\dots, x_n) = \\\\!
            &= (x_1 K_{n-1}(x_2, \\dots) + K_{n-2}(x_3, \\dots)) K_n(x_2, \\dots, x_{n+1}) \\\\!
            &- (x_1 K_n(x_2, \\dots, x_{n+1}) + K_{n-1}(x_3, \\dots, x_{n+1})) K_{n-1}(x_2, \\dots) \\\\!
            &= K_{n-2}(x_3, \\dots) K_n(x_2, \\dots, x_{n+1}) - K_{n-1}(x_3, \\dots, x_{n+1}) K_{n-1}(x_2, \\dots) = \\\\!
            &= - ( K_{n-1}(x_2, \\dots) K_{n-1}(x_3, \\dots, x_{n+1}) - K_n(x_2, \\dots, x_{n+1}) K_{n-2}(x_3, \\dots) )
        }
    `});var m=r(t,2);c(m,{children:(p,d)=>{_();var e=Ra(),l=r($(e));a(l,{m:"x_1"}),_(),o(p,e)}}),o(x,n)}});var ar=r(rr,2);X(ar,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=q("Из этого тождества и основного свойства полиномов следует, что");o(n,t)}})}});var _r=r(ar,2);S(_r,{title:"Обобщённая цепная дробь",children:(x,P)=>{a(x,{display:!0,m:`
        \\/ x_1, \\dots, x_n \\/ = \\frac{1}{q_0 q_1} - \\frac{1}{q_1 q_2} + \\frac{1}{q_2 q_3} - \\dots +
        \\frac{(-1)^{n-1}}{q_{n-1} q_n} \\quad \\text{где } q_k = K_k(x_1, \\dots, x_k)
    `})}});var or=r(_r,2);j(or,{children:(x,P)=>{_();var n=q("Связь с правильными цепными дробями");o(x,n)}});var nr=r(or,2);H(nr,{children:(x,P)=>{var n=Da(),s=$(n);c(s,{children:(m,p)=>{_();var d=ja(),e=r($(d));a(e,{m:"X"});var l=r(e,2);a(l,{m:"0 \\le X < 1"});var i=r(l,2);a(i,{m:"X_0 = X"});var f=r(i,2);a(f,{m:"n \\ge 0"});var h=r(f,2);a(h,{m:"X_n \\ne 0"}),_(),o(m,d)}});var t=r(s,2);a(t,{display:!0,m:`
        A_{n+1} = \\lfloor 1/X_n \\rfloor, \\quad X_{n+1} = 1/X_n - A_{n+1}
    `}),o(x,n)}});var er=r(nr,2);X(er,{children:(x,P)=>{var n=Ba(),s=$(n);c(s,{children:(i,f)=>{_();var h=Ha(),y=r($(h));a(y,{m:"X_n = 0"});var g=r(y,2);a(g,{m:"A_{n+1}"});var K=r(g,2);a(K,{m:"X_{n+1}"});var u=r(K,2);a(u,{m:"X"});var b=r(u,2);a(b,{m:"\\/ A_1, \\dots, A_n \\/"});var F=r(b,2);a(F,{m:"X_n \\ne 0"});var A=r(F,2);a(A,{m:"0 \\le X_{n+1} < 1"});var k=r(A,2);a(k,{m:"A"}),_(),o(i,h)}});var t=r(s,2);c(t,{children:(i,f)=>{_();var h=q("Из указанных правил следует, что");o(i,h)}});var m=r(t,2);a(m,{display:!0,m:`
        X = X_0 = \\frac{1}{A_1 + X_1} = \\frac{1}{A_1 + 1/(A_2 + X_2)} = \\dots
    `});var p=r(m,2);c(p,{children:(i,f)=>{_();var h=q("поэтому");o(i,h)}});var d=r(p,2);a(d,{display:!0,m:`
        X = \\/ A_1, \\dots, A_{n-1}, A_n + X_n \\/ \\quad \\text {для всех } n \\ge1 \\text { для которых определено }X_n
    `});var e=r(d,2);c(e,{children:(i,f)=>{_();var h=Sa(),y=r($(h));a(y,{m:"X_n = 0"});var g=r(y,2);a(g,{m:"X = \\/ A_1, \\dots, A_n \\/"}),_(),o(i,h)}});var l=r(e,2);c(l,{children:(i,f)=>{_();var h=wa(),y=r($(h));a(y,{m:"X_n \\ne 0"});var g=r(y,2);a(g,{m:"X"});var K=r(g,2);a(K,{m:"\\/ A_1, \\dots, A_n \\/"});var u=r(K,2);a(u,{m:"\\/ A_1, \\dots, A_n + 1 \\/"});var b=r(u,2);a(b,{m:"K"});var F=r(b,2);a(F,{m:"q_n = K_n(A_1, \\dots, A_n + X_n)"});var A=r(F,2);a(A,{m:"K_n(A_1, \\dots, A_n)"});var k=r(A,2);a(k,{m:"K_n(A_1, \\dots, A_n + 1)"});var z=r(k,2);a(z,{m:"X_n"});var M=r(z,2);a(M,{m:"q_n"});var C=r(M,2);a(C,{m:"n"}),_(),o(i,h)}}),o(x,n)}});var dr=r(er,2);X(dr,{children:(x,P)=>{var n=Ia(),s=$(n);c(s,{children:(e,l)=>{_();var i=q("Оценим точность такого представления числа:");o(e,i)}});var t=r(s,2);a(t,{display:!0,m:`
        \\align{
            \\left| X - \\/ A_1, \\dots, A_n \\/ \\right|
            = \\left| \\/ A_1, \\dots, A_n + X_n \\/ - \\/ A_1, \\dots, A_n \\/ \\right|
            &= \\left| \\/ A_1, \\dots, A_n, 1/X_n \\/ - \\/ A_1, \\dots, A_n \\/ \\right| = \\\\!!
            = \\left| \\frac{K_n(A_2, \\dots, A_n, 1/X_n)}{K_{n+1}(A_1, \\dots, A_n, 1/X_n)} - \\frac{K_{n-1}(A_2, \\dots, A_n)}{K_n(A_1, \\dots, A_n)} \\right|
            &= 1 / (K_n(A_1, \\dots, A_n) K_{n+1}(A_1, \\dots, A_n, 1/X_n)) \\\\!!
            &\\le 1 / (K_n(A_1, \\dots, A_n) K_{n+1}(A_1, \\dots, A_n, A_{n+1}))
        }
    `});var m=r(t,2);c(m,{children:(e,l)=>{_();var i=Ea(),f=r($(i));a(f,{m:"\\/ A_1, \\dots, A_n \\/"});var h=r(f,4);a(h,{m:"X"});var y=r(h,2);a(y,{m:"n"});var g=r(y,2);a(g,{m:"X_n"});var K=r(g,2);a(K,{m:"n"});var u=r(K,2);a(u,{m:"\\/ A_1, A_2, A_3, \\dots \\/"}),_(),o(e,i)}});var p=r(m,2);a(p,{display:!0,m:`
        \\lim_{n \\to \\infty} \\/ A_1, A_2, \\dots, A_n \\/
    `});var d=r(p,2);c(d,{children:(e,l)=>{_();var i=Ga(),f=r($(i));a(f,{m:"X"}),_(),o(e,i)}}),o(x,n)}});var tr=r(dr,2);X(tr,{children:(x,P)=>{var n=Ua(),s=$(n);c(s,{children:(l,i)=>{_();var f=Ja(),h=r($(f));a(h,{m:"X = \\frac{\\sqrt{5}-1}{2} =\\vphi^-1"}),_(),o(l,f)}});var t=r(s,2);c(t,{children:(l,i)=>{_();var f=La(),h=r($(f));a(h,{m:"X"});var y=r(h,2);a(y,{display:!0,m:`
            1/X_0 = \\frac{2}{\\sqrt{5}-1} = \\frac{1+\\sqrt{5}}{2} \\approx 1.618
        `}),o(l,f)}});var m=r(t,2);c(m,{children:(l,i)=>{_();var f=Na(),h=r($(f));a(h,{display:!0,m:`
            A_1 = \\lfloor 1.618 \\rfloor = 1
        `}),o(l,f)}});var p=r(m,2);c(p,{children:(l,i)=>{_();var f=Oa(),h=r($(f));a(h,{display:!0,m:`
            X_1 = 1.618 - 1 = 0.618 = X_0
        `}),o(l,f)}});var d=r(p,2);c(d,{children:(l,i)=>{_();var f=Qa(),h=r($(f));a(h,{m:"X_1"});var y=r(h,2);a(y,{m:"A_n"}),_(),o(l,f)}});var e=r(d,2);a(e,{display:!0,m:`
        \\cfrac{\\sqrt{5}-1}{2} = \\cfrac{1}{1 + \\cfrac{1}{1 + \\cfrac{1}{1 + \\ddots}}} = \\/ 1, 1, 1, \\dots \\/
    `}),o(x,n)}});var vr=r(tr,2);X(vr,{children:(x,P)=>{var n=Wa(),s=$(n);c(s,{children:(p,d)=>{_();var e=q(`Разложение вещественных чисел в правильную цепную дробь обладает рядом свойств, аналогичных свойствам чисел,
    представленных в десятичной системе счисления. Если при помощи приведенных выше формул разложить в правильные
    цепные дроби некоторые известные вещественные числа, получим, например,`);o(p,e)}});var t=r(s,2);a(t,{display:!0,m:`\\align{
          \\sqrt[3]{2} &= 1 + {}&2& \\/ 3, 1, 5, 1, 1, 4, 1, 1, 8, 1, 14, 1, 10, 2, 1, 4, 12, 2, 3, 2, 1, 3, 4, 1, 1, 2, 14, 3, \\dots \\/ \\\\
          \\pi &= 3 + {}&& \\/ 7, 15, 1, 292, 1, 1, 1, 2, 1, 3, 1, 14, 2, 1, 1, 2, 2, 2, 2, 1, 84, 2, 1, 1, 15, 3, 13, \\dots \\/  \\\\
          e &= 2 + {}&& \\/ 1, 2, 1, 1, 4, 1, 1, 6, 1, 1, 8, 1, 1, 10, 1, 1, 12, 1, 1, 14, 1, 1, 16, 1, 1, 18, 1, \\dots \\/ \\\\
          \\gamma &= {}&& \\/ 1, 1, 2, 1, 2, 1, 4, 3, 13, 5, 1, 1, 8, 1, 2, 4, 1, 1, 40, 1, 11, 3, 7, 1, 7, 1, 1, 5, 1, 49, \\dots \\/ \\\\
          \\vphi &= 1 + {}&& \\/ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, \\dots \\/
          }`});var m=r(t,2);c(m,{children:(p,d)=>{_();var e=Va(),l=r($(e));a(l,{m:"A_1, A_2, \\dots"});var i=r(l,4);a(i,{m:"X"});var f=r(i,2);a(f,{m:"\\vphi"});var h=r(f,2);a(h,{m:"e"});var y=r(h,2);a(y,{m:"\\sqrt[3]{2}"});var g=r(y,2);a(g,{m:"\\pi"});var K=r(g,2);a(K,{m:"\\gamma"}),_(),o(p,e)}}),o(x,n)}});var sr=r(vr,2);Ur(sr,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=Ya(),m=r($(t));a(m,{m:"x = y"});var p=r(m,2);a(p,{m:"x < r"});var d=r(p,2);a(d,{m:"r"});var e=r(d,2);a(e,{m:"y < r"}),_(),o(n,t)}})}});var lr=r(sr,2);X(lr,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=Za(),m=r($(t));a(m,{m:"X"}),_(),o(n,t)}})}});var mr=r(lr,2);j(mr,{children:(x,P)=>{_();var n=q("Аппроксимация алгебраических иррациональностей");o(x,n)}});var ir=r(mr,2);S(ir,{title:"Теорема Лиувилля",children:(x,P)=>{var n=a_(),s=$(n);c(s,{children:(m,p)=>{_();var d=r_(),e=r($(d));a(e,{m:"\\alpha"});var l=r(e,2);a(l,{m:"n"});var i=r(l,2);a(i,{m:"C"});var f=r(i,2);a(f,{m:"p"});var h=r(f,2);a(h,{m:"q"}),o(m,d)}});var t=r(s,2);a(t,{display:!0,m:`
        \\left| \\alpha - \\frac{p}{q} \\right| > \\frac{C}{q^n} \\quad q > 0
    `}),o(x,n)}});var xr=r(ir,2);R(xr,{children:(x,P)=>{var n=l_(),s=$(n);c(s,{children:(b,F)=>{_();var A=__(),k=r($(A));a(k,{m:"\\alpha"});var z=r(k,2);a(z,{m:"f(x)"});var M=r(z,2);a(M,{m:"n"}),_(),o(b,A)}});var t=r(s,2);a(t,{display:!0,m:`
        f(x) = (x - \\alpha) f_1(x) \\quad \\text {где } f_1(x) \\text { многочлен степени } n - 1
    `});var m=r(t,2);c(m,{children:(b,F)=>{_();var A=o_(),k=r($(A));a(k,{m:"f_1(\\alpha) \\ne 0"}),_(),o(b,A)}});var p=r(m,2);c(p,{children:(b,F)=>{_();var A=n_(),k=r($(A));a(k,{m:"f_1(\\alpha) = 0"});var z=r(k,2);a(z,{m:"f_1(x)"});var M=r(z,2);a(M,{m:"x - \\alpha"});var C=r(M,2);a(C,{m:"f(x)"});var T=r(C,2);a(T,{m:"(x - \\alpha)^2"});var D=r(T,2);a(D,{m:"f'(x)"});var Jr=r(D,2);a(Jr,{m:"x - \\alpha"});var Lr=r(Jr,2);a(Lr,{m:"f'(\\alpha) = 0"});var Nr=r(Lr,2);a(Nr,{m:"f'(x)"});var Or=r(Nr,2);a(Or,{m:"n-1"});var Qr=r(Or,2);a(Qr,{m:"\\alpha"});var Zr=r(Qr,2);a(Zr,{m:"n"}),_(),o(b,A)}});var d=r(p,2);c(d,{children:(b,F)=>{_();var A=e_(),k=r($(A));a(k,{m:"f_1(\\alpha) \\ne 0"});var z=r(k,2);a(z,{m:"\\delta"}),_(),o(b,A)}});var e=r(d,2);a(e,{display:!0,m:`
        f_1(x) \\ne 0 \\quad (\\text{при } \\alpha - \\delta \\le x \\le \\alpha + \\delta)
    `});var l=r(e,2);c(l,{children:(b,F)=>{_();var A=d_(),k=r($(A));a(k,{m:"p"});var z=r(k,2);a(z,{m:"q"});var M=r(z,2);a(M,{m:"q > 0"});var C=r(M,2);a(C,{m:"|\\alpha - p/q| \\le \\delta"});var T=r(C,2);a(T,{m:"f_1(p/q) \\ne 0"});var D=r(T,2);a(D,{m:"x = p/q"}),_(),o(b,A)}});var i=r(l,2);a(i,{display:!0,m:`
        \\align{
            \\frac{p}{q} - \\alpha
            &= \\frac{f(p/q)}{f_1(p/q)}
            = \\frac{a_0 + a_1(p/q) + \\dots + a_n(p/q)^n}{f_1(p/q)} \\\\!!
            &= \\frac{a_0 q^n + a_1 p q^{n-1} + \\dots + a_n p^n}{q^n f_1(p/q)}
        }
    `});var f=r(i,2);c(f,{children:(b,F)=>{_();var A=t_(),k=r($(A));a(k,{m:"\\alpha = p/q"});var z=r(k,2);a(z,{m:"\\alpha"});var M=r(z,2);a(M,{m:"M"});var C=r(M,2);a(C,{m:"f_1(x)"});var T=r(C,2);a(T,{m:"(\\alpha - \\delta, \\alpha + \\delta)"}),_(),o(b,A)}});var h=r(f,2);a(h,{display:!0,m:`
        \\left| \\alpha - \\frac{p}{q} \\right| > \\frac{1}{M q^n}
    `});var y=r(h,2);c(y,{children:(b,F)=>{_();var A=v_(),k=r($(A));a(k,{m:"|\\alpha - p/q| > \\delta"}),_(),o(b,A)}});var g=r(y,2);a(g,{display:!0,m:`
        \\left| \\alpha - \\frac{p}{q} \\right| > \\frac{\\delta}{q^n}
    `});var K=r(g,2);c(K,{children:(b,F)=>{_();var A=s_(),k=r($(A));a(k,{m:"q \\ge 1"});var z=r(k,2);a(z,{m:"\\delta \\ge \\delta/q^n"});var M=r(z,2);a(M,{m:"C"});var C=r(M,2);a(C,{m:"\\delta"});var T=r(C,2);a(T,{m:"1/M"}),_(),o(b,A)}});var u=r(K,2);a(u,{display:!0,m:`
        \\left| \\alpha - \\frac{p}{q} \\right| > \\frac{C}{q^n}
    `}),o(x,n)}});var cr=r(xr,2);j(cr,{children:(x,P)=>{_();var n=q("Цепные дроби для функций");o(x,n)}});var $r=r(cr,2);X($r,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=q(`До сих пор мы рассматривали цепные дроби как способ представления чисел. Однако их мощь раскрывается в полной мере
    при представлении функций. Одним из самых общих методов построения таких разложений является метод дифференциальных
    уравнений, разработанный Лагранжем.`);o(n,t)}})}});var pr=r($r,2);Vr(pr,{children:(x,P)=>{_();var n=q("Метод Лагранжа");o(x,n)}});var fr=r(pr,2);X(fr,{children:(x,P)=>{var n=i_(),s=$(n);c(s,{children:(p,d)=>{_();var e=q(`Лагранж предложил универсальный способ решения дифференциальных уравнений с помощью цепных дробей. Он рассматривал
    обобщенное уравнение Риккати вида:`);o(p,e)}});var t=r(s,2);a(t,{display:!0,m:`
        (\\alpha + \\alpha' x^k) y' + (\\beta + \\beta' x^k) y + \\gamma y^2 = \\delta x^k, \\quad y(0) = 0
    `});var m=r(t,2);c(m,{children:(p,d)=>{_();var e=m_(),l=r($(e));a(l,{m:"\\alpha, \\beta, \\dots"});var i=r(l,2);a(i,{m:"k"}),_(),o(p,e)}}),o(x,n)}});var hr=r(fr,2);X(hr,{children:(x,P)=>{var n=c_(),s=$(n);c(s,{children:(d,e)=>{_();var l=q("Чтобы представить решение в виде цепной дроби, Лагранж использовал подстановку:");o(d,l)}});var t=r(s,2);a(t,{display:!0,m:`
        y = \\frac{\\delta x^k}{u(x)}
    `});var m=r(t,2);c(m,{children:(d,e)=>{_();var l=x_(),i=r($(l));a(i,{m:"u(x)"});var f=r(i,2);a(f,{m:"u(x)"});var h=r(f,2);a(h,{m:"(k\\alpha + \\beta)"}),_(),o(d,l)}});var p=r(m,2);c(p,{children:(d,e)=>{_();var l=q("Этот процесс порождает бесконечную вложенность, которая и дает итоговую формулу:");o(d,l)}}),o(x,n)}});var Pr=r(hr,2);Ur(Pr,{title:"Универсальная формула разложения",children:(x,P)=>{var n=p_(),s=$(n);a(s,{display:!0,m:`
        y = \\cfrac{\\delta x^k}{
            k\\alpha + \\beta + \\cfrac{((k\\alpha + \\beta)(k\\alpha' + \\beta') + \\gamma\\delta) x^k}{
                2k\\alpha + \\beta + \\cfrac{(k^2\\alpha\\alpha' - \\dots ) x^k}{
                    3k\\alpha + \\beta + \\dots
                }
            }
        }
    `});var t=r(s,2);c(t,{children:(m,p)=>{_();var d=$_(),e=r($(d));a(e,{m:"\\alpha, \\beta, \\gamma"}),_(),o(m,d)}}),o(x,n)}});var gr=r(Pr,2);Vr(gr,{children:(x,P)=>{_();var n=q("Разложения основных функций");o(x,n)}});var ur=r(gr,2);X(ur,{children:(x,P)=>{var n=P_(),s=$(n);c(s,{children:(m,p)=>{var d=f_();o(m,d)}});var t=r(s,2);c(t,{children:(m,p)=>{_();var d=h_(),e=r($(d));a(e,{m:"y = (1+x)^\\nu"}),_(),o(m,d)}}),o(x,n)}});var br=r(ur,2);R(br,{children:(x,P)=>{var n=u_(),s=$(n);c(s,{children:(p,d)=>{_();var e=g_(),l=r($(e));a(l,{m:"(1+x)y' = \\nu y"}),_(),o(p,e)}});var t=r(s,2);a(t,{display:!0,m:`
        (1+x)y' - \\nu y = 0 \\implies \\alpha=1, \\alpha'=1, \\beta=-\\nu, \\beta'=0, \\gamma=0, \\delta=0
    `});var m=r(t,2);c(m,{children:(p,d)=>{_();var e=q("Подставляя эти параметры в общую формулу Лагранжа, получаем разложение:");o(p,e)}}),o(x,n)}});var yr=r(br,2);X(yr,{children:(x,P)=>{var n=K_(),s=$(n);a(s,{display:!0,m:`
        (1+x)^\\nu = 1 + \\cfrac{\\nu x}{1 + \\cfrac{(1-\\nu)x}{2 + \\cfrac{(1+\\nu)x}{3 + \\cfrac{(2-\\nu)x}{2 + \\dots}}}}
    `});var t=r(s,2);c(t,{children:(p,d)=>{_();var e=b_(),l=r($(e));a(l,{m:"(-\\infty, -1]"}),_(),o(p,e)}});var m=r(t,2);c(m,{children:(p,d)=>{var e=y_();o(p,e)}}),o(x,n)}});var Kr=r(yr,2);R(Kr,{children:(x,P)=>{var n=q_(),s=$(n);c(s,{children:(p,d)=>{_();var e=q("Используем предельный переход из степенной функции:");o(p,e)}});var t=r(s,2);a(t,{display:!0,m:`
        \\ln(1+x) = \\lim_{\\nu \\to 0} \\frac{(1+x)^\\nu - 1}{\\nu}
    `});var m=r(t,2);c(m,{children:(p,d)=>{_();var e=A_(),l=r($(e));a(l,{m:"\\nu \\to 0"});var i=r(l,2);a(i,{m:"(1-\\nu)x \\to 1^2 x"});var f=r(i,2);a(f,{m:"(1+\\nu)x \\to x"});var h=r(f,2);a(h,{m:"\\nu"}),_(),o(p,e)}}),o(x,n)}});var Ar=r(Kr,2);X(Ar,{children:(x,P)=>{var n=X_(),s=$(n);a(s,{display:!0,m:`
        \\ln(1+x) = \\frac{x}{1 + \\/ 1^2 x, 2^2 x, 3^2 x, \\dots \\/}
    `});var t=r(s,2);c(t,{children:(m,p)=>{var d=k_();o(m,d)}}),o(x,n)}});var qr=r(Ar,2);R(qr,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=F_(),m=r($(t));a(m,{m:"x \\to x/\\nu"});var p=r(m,2);a(p,{m:"\\nu \\to \\infty"});var d=r(p,2);a(d,{m:"(1 + x/\\nu)^\\nu \\to e^x"});var e=r(d,2);a(e,{m:"(1-\\nu)x/\\nu \\approx -x"});var l=r(e,2);a(l,{m:"(1+\\nu)x/\\nu \\approx x"}),_(),o(n,t)}})}});var kr=r(qr,2);X(kr,{children:(x,P)=>{var n=M_(),s=$(n);a(s,{display:!0,m:`
        e^x = 1 + \\cfrac{x}{1 - \\cfrac{x}{2 + \\cfrac{x}{3 - \\cfrac{x}{2 + \\dots}}}}
    `});var t=r(s,2);c(t,{children:(d,e)=>{_();var l=q("Сжатие этой дроби приводит к более известной форме, полученной Эйлером:");o(d,l)}});var m=r(t,2);a(m,{display:!0,m:`
        e^x = 1 + \\cfrac{2x}{2-x + \\cfrac{x^2}{6 + \\cfrac{x^2}{10 + \\dots}}}
    `});var p=r(m,2);c(p,{children:(d,e)=>{var l=z_();o(d,l)}}),o(x,n)}});var Xr=r(kr,2);R(Xr,{children:(x,P)=>{var n=R_(),s=$(n);c(s,{children:(p,d)=>{_();var e=C_(),l=r($(e));a(l,{m:"y = \\arctan x"});var i=r(l,2);a(i,{m:"y' = 1/(1+x^2)"});var f=r(i,2);a(f,{m:"(1+x^2)y' = 1"});var h=r(f,2);a(h,{m:"k=2"}),_(),o(p,e)}});var t=r(s,2);a(t,{display:!0,m:`
        \\alpha=1, \\alpha'=1, \\beta=0, \\gamma=0, \\delta=1
    `});var m=r(t,2);c(m,{children:(p,d)=>{_();var e=q("Прямая подстановка в формулу Лагранжа дает:");o(p,e)}}),o(x,n)}});var Fr=r(Xr,2);X(Fr,{children:(x,P)=>{var n=j_(),s=$(n);a(s,{display:!0,m:`
        \\arctan x = \\frac{x}{1 + \\/ 1^2 x^2, 2^2 x^2, 3^2 x^2, 4^2 x^2, \\dots \\/}
    `});var t=r(s,2);c(t,{children:(m,p)=>{var d=T_();o(m,d)}}),o(x,n)}});var zr=r(Fr,2);R(zr,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=D_(),m=r($(t));a(m,{m:"y = \\tan x"});var p=r(m,2);a(p,{m:"y' = 1+y^2"});var d=r(p,2);a(d,{m:"\\gamma = -1"});var e=r(d,2);a(e,{m:"y^2"});var l=r(e,2);a(l,{m:"y' - y^2 = 1"}),_(),o(n,t)}})}});var Mr=r(zr,2);X(Mr,{children:(x,P)=>{a(x,{display:!0,m:`
        \\tan x = \\cfrac{x}{1 - \\cfrac{x^2}{3 - \\cfrac{x^2}{5 - \\dots}}}
    `})}});var Cr=r(Mr,2);j(Cr,{children:(x,P)=>{_();var n=q("Вычисление цепных дробей через гипергеометрические функции");o(x,n)}});var Rr=r(Cr,2);X(Rr,{children:(x,P)=>{c(x,{children:(n,s)=>{_();var t=H_(),m=r($(t),5);a(m,{m:"{}_2F_1"}),_(),o(n,t)}})}});var Tr=r(Rr,2);X(Tr,{children:(x,P)=>{var n=G_(),s=$(n);c(s,{children:(y,g)=>{_();var K=q("Рассмотрим общий метод построения дробей для отношений гипергеометрических рядов.");o(y,K)}});var t=r(s,2);c(t,{children:(y,g)=>{var K=S_();o(y,K)}});var m=r(t,2);c(m,{children:(y,g)=>{_();var K=w_(),u=r($(K));a(u,{m:"f_0, f_1, f_2, \\dots"}),_(),o(y,K)}});var p=r(m,2);a(p,{display:!0,m:`
        f_{i-1} - f_i = k_i x f_{i+1}
    `});var d=r(p,2);c(d,{children:(y,g)=>{_();var K=B_(),u=r($(K));a(u,{m:"f_i"}),_(),o(y,K)}});var e=r(d,2);a(e,{display:!0,m:`
        \\frac{f_{i-1}}{f_i} - 1 = k_i x \\frac{f_{i+1}}{f_i} \\quad \\implies \\quad \\frac{f_{i-1}}{f_i} = 1 + \\dfrac{k_i x}{f_i / f_{i+1}}
    `});var l=r(e,2);c(l,{children:(y,g)=>{_();var K=q("Перевернув дробь, получаем рекурсивную формулу:");o(y,K)}});var i=r(l,2);a(i,{display:!0,m:`
        \\frac{f_i}{f_{i-1}} = \\dfrac{1}{1 + k_i x \\frac{f_{i+1}}{f_i}}
    `});var f=r(i,2);c(f,{children:(y,g)=>{_();var K=E_(),u=r($(K));a(u,{m:"i=1, 2, \\dots"});var b=r(u,2);a(b,{m:"\\mathbf{K}"}),_(),o(y,K)}});var h=r(f,2);a(h,{display:!0,m:`
        \\frac{f_1}{f_0} = \\dfrac{1}{1 + \\mathbf{K}_{n=1}^\\infty \\dfrac{k_n x}{1}}
    `}),o(x,n)}});var jr=r(Tr,2);X(jr,{children:(x,P)=>{var n=N_(),s=$(n);c(s,{children:(e,l)=>{var i=I_(),f=r(w(i));a(f,{m:"{}_0F_1"}),_(),B(i),o(e,i)}});var t=r(s,2);c(t,{children:(e,l)=>{_();var i=J_(),f=r($(i));a(f,{m:"{}_0F_1(a; x)"}),_(),o(e,i)}});var m=r(t,2);a(m,{display:!0,m:`
        {}_0F_1(a; x) - {}_0F_1(a-1; x) = -\\dfrac{x}{a(a-1)} {}_0F_1(a+1; x)
    `});var p=r(m,2);c(p,{children:(e,l)=>{_();var i=L_(),f=r($(i));a(f,{m:"f_i = {}_0F_1(a+i; x)"}),_(),o(e,i)}});var d=r(p,2);a(d,{display:!0,m:`
        \\frac{{}_0F_1(a+1 \\mid x)}{{}_0F_1(a \\mid x)} = \\dfrac{1}{a + \\mathbf{K}_{n=1}^\\infty \\dfrac{x}{a+n}}
    `}),o(x,n)}});var Dr=r(jr,2);X(Dr,{children:(x,P)=>{var n=V_(),s=$(n);c(s,{children:(d,e)=>{var l=O_(),i=r(w(l));a(i,{m:"{}_1F_1"}),_(),B(l),o(d,l)}});var t=r(s,2);c(t,{children:(d,e)=>{_();var l=Q_(),i=r($(l));a(i,{m:"a"});var f=r(i,2);a(f,{m:"b"}),_(),o(d,l)}});var m=r(t,2);a(m,{display:!0,m:`
        \\frac{{}_1F_1(a+1 \\mid b+1 \\mid x)}{{}_1F_1(a \\mid b \\mid x)} = \\dfrac{1}{b + \\mathbf{K}_{n=1}^\\infty \\dfrac{k_n x}{b+n}}
    `});var p=r(m,2);c(p,{children:(d,e)=>{_();var l=U_(),i=r($(l));a(i,{m:"k_n"});var f=r(i,2);a(f,{m:"n"});var h=r(f,2);a(h,{m:"k_{2m} = b+m"});var y=r(h,2);a(y,{m:"k_{2m+1} = a-b-m"}),_(),o(d,l)}}),o(x,n)}});var Hr=r(Dr,2);X(Hr,{children:(x,P)=>{var n=Z_(),s=$(n);c(s,{children:(e,l)=>{var i=W_(),f=r(w(i));a(f,{m:"{}_2F_1"}),B(i),o(e,i)}});var t=r(s,2);c(t,{children:(e,l)=>{_();var i=q("Это наиболее общий случай. Рекуррентные соотношения Гаусса (связывающие смежные функции) приводят к разложению:");o(e,i)}});var m=r(t,2);a(m,{display:!0,m:`
        \\frac{{}_2F_1(a+1, b+1 \\mid c+1 \\mid x)}{{}_2F_1(a, b \\mid c \\mid x)} = \\dfrac{1}{1 + \\mathbf{K}_{n=1}^\\infty \\dfrac{k_n x}{1}}
    `});var p=r(m,2);c(p,{children:(e,l)=>{_();var i=Y_(),f=r($(i));a(f,{m:"k_n"}),_(),o(e,i)}});var d=r(p,2);a(d,{display:!0,m:`
        k_{2m+1} = -\\dfrac{(a+m)(c-b+m)}{(c+2m)(c+2m+1)} \\quad k_{2m+2} = -\\dfrac{(b+m+1)(c-a+m+1)}{(c+2m+1)(c+2m+2)}
    `}),o(x,n)}});var Sr=r(Hr,2);j(Sr,{children:(x,P)=>{_();var n=q("Примеры применения");o(x,n)}});var wr=r(Sr,2);X(wr,{children:(x,P)=>{var n=_o(),s=$(n);c(s,{children:(p,d)=>{_();var e=q("Применим полученные алгоритмы к конкретным элементарным функциям.");o(p,e)}});var t=r(s,2);c(t,{children:(p,d)=>{var e=ro();o(p,e)}});var m=r(t,2);c(m,{children:(p,d)=>{_();var e=ao(),l=r($(e));a(l,{m:"\\arctan z = z \\cdot {}_2F_1(1/2, 1; 3/2; -z^2)"}),_(),o(p,e)}}),o(x,n)}});var Br=r(wr,2);R(Br,{children:(x,P)=>{var n=no(),s=$(n);c(s,{children:(m,p)=>{_();var d=oo(),e=r($(d));a(e,{m:"a=1/2, b=1, c=3/2"}),_(),o(m,d)}});var t=r(s,2);a(t,{display:!0,m:`
        \\arctan z = \\dfrac{z}{1 + \\mathbf{K}_{n=1}^\\infty \\dfrac{(nz)^2}{2n+1}}
    `}),o(x,n)}});var Er=r(Br,2);X(Er,{children:(x,P)=>{var n=vo(),s=$(n);c(s,{children:(m,p)=>{var d=eo();o(m,d)}});var t=r(s,2);c(t,{children:(m,p)=>{_();var d=to(),e=r($(d));a(e,{m:"e^z = {}_1F_1(1; 1; z)"}),_(),o(m,d)}}),o(x,n)}});var Gr=r(Er,2);R(Gr,{children:(x,P)=>{var n=lo(),s=$(n);c(s,{children:(m,p)=>{_();var d=so(),e=r($(d));a(e,{m:"b \\to \\infty"}),_(),o(m,d)}});var t=r(s,2);a(t,{display:!0,m:`
        e^z = \\dfrac{1}{1 + \\mathbf{K}_{n=1}^\\infty \\dfrac{c_n z}{1}} = \\dfrac{1}{1 + \\dfrac{-z}{1 + \\dfrac{z/2}{1 + \\dfrac{-z/6}{1 + \\dots}}}}
    `}),o(x,n)}});var Ir=r(Gr,2);X(Ir,{children:(x,P)=>{var n=xo(),s=$(n);c(s,{children:(m,p)=>{var d=mo();o(m,d)}});var t=r(s,2);c(t,{children:(m,p)=>{_();var d=io(),e=r($(d));a(e,{m:"{}_0F_1"}),_(),o(m,d)}}),o(x,n)}});var Yr=r(Ir,2);R(Yr,{children:(x,P)=>{var n=co(),s=$(n);c(s,{children:(m,p)=>{_();var d=q("Преобразование дроби приводит к знаменитой формуле с нечетными числами в знаменателях:");o(m,d)}});var t=r(s,2);a(t,{display:!0,m:`
        \\tan z = \\dfrac{z}{1 - \\mathbf{K}_{n=1}^\\infty \\dfrac{z^2}{2n+1}} = \\dfrac{z}{1 - \\dfrac{z^2}{3 - \\dfrac{z^2}{5 - \\dots}}}
    `}),o(x,n)}}),o(Wr,E)}export{Mo as component};
