import"../chunks/CWj6FrbW.js";import"../chunks/69_IOA4Y.js";import{f as _,a as d,b as a,s as r,n as o,t as u}from"../chunks/BWp35gWV.js";import{T as mn}from"../chunks/CR7k0xtG.js";import{P as ir}from"../chunks/DPzc5wQr.js";import{P as e}from"../chunks/B7flgP-x.js";/* empty css                *//* empty css                *//* empty css                */import"../chunks/i9XClpbl.js";/* empty css                *//* empty css                */import{H as Nr}from"../chunks/DXKx2xvL.js";import{M as n}from"../chunks/BqyEoRxA.js";/* empty css                *//* empty css                */import{P as an}from"../chunks/BBkyo9uE.js";import{D as en}from"../chunks/DlTIf4aM.js";var vn=_(`Числа Стирлинга, названные в честь Джеймса Стирлинга,
    имеют две разновидности и обычно называются числами Стирлинга первого и второго рода.
    Несмотря на долгую историю и многочисленные применения, для этих чисел до сих пор нет общепринятого обозначения.
    Воспользуемся обозначениями, введёнными Йованом Караматой, и будем записывать числа Стирлинга первого рода как <!>,
    а числа Стирлинга второго рода &mdash; как <!>.
    Числа Стирлинга второго рода встречаются чаще, поэтому они будут рассмотрены в первую очередь.`,1),sn=_(`<b>Число Стирлинга второго рода</b> <!> &mdash; число способов разбиения множества
    из <!> элементов на <!> непустых непересекающихся подмножеств.`,1),ln=_(`Существует только один способ разделить пустое множество на <!> непустых частей.
    А вот непустое множество невозможно разделить на <!> непустых частей.
    Поэтому:`,1),kn=_("Множество уже разделено на <!> часть. Значит:",1),cn=_(`Если множество разделено на <!> непустые части, то в одной из частей должен содержаться первый элемент
    и ещё некоторое подмножество из <!> оставшихся элементов.
    Всего подмножеств <!>.
    Но подмножество не может содержать все оставшиеся элементы, потому что обе части должны быть непустыми.
    Значит:`,1),pn=_("<!> <!> <!> <!> <!> <!>",1),un=_(`Попробуем получить общую рекуррентную формулу.
    Первый элемент мы можем поместить в отдельный класс <!> способами,
    либо мы можем поместить его в некоторое непустое множество из остальных <!> элементов.
    В последнем случае имеется <!> возможных вариантов,
    потому что каждый из <!> способов распределения первых <!> объектов по <!> непустым частям даёт <!> подмножеств,
    с которыми можно объединить <!>-ый объект. Следовательно:`,1),$n=_(`Как быть, если мы хотим приблизительно посчитать значение нужного нам числа Стирлинга второго рода?
    Пусть оно имеет вид <!>.
    Если бы каждый элемент образовывал блок из одного элемента, число блоков было бы <!>.
    Чтобы получить их ровно <!>, нужно сократить количество блоков на <!>,
    что возможно только за счёт объединения некоторых элементов.
    Тогда почему бы нам не создавать ровно <!> блоков размера два и оставить остальные блоки одноэлементными.
    Выберем <!> элементов, которые войдут в пары.`,1),fn=_(`Теперь разобьем эти <!> выбранных элементов на <!> неупорядоченных пар.
    Число таких разбиений известно:`,1),In=_("Таким образом, число разбиений, в которых блоки имеют только размеры <!> и <!>, равно",1),hn=_("Разложим факториальную часть при больших <!>:",1),xn=_(`Остаётся заметить, что любое разбиение, содержащее хотя бы один блок размера <!>,
    включает в объединения меньше, чем <!> различных элементов.
    Значит, число таких разбиений есть многочлен по <!> меньшей степени,
    чем <!>, и потому даёт вклад порядка <!>.
    Следовательно, доминирующий член в асимптотике порождён разбиениями,
    содержащими ровно <!> блоков размера два и остальные одноэлементные. Таким образом,`,1),Pn=_(`Посмотрим на разбиение множества из <!> элементов на <!> непустых подмножеств.
    Рассмотрим один определённый элемент, пусть он входит в блок размера <!>,
    тогда оставшиеся <!> элементов этого блока можно выбрать <!> способами,
    а остальные <!> элементов разбиваются на <!> блоков <!>.
    Суммируем по всем <!> и получаем:`,1),gn=_(`Посмотрим, что значит запись <!>.
    Это количество способов разделить множество на m упорядоченных непустых подмножеств множества,
    состоящего из <!> элементов. Теперь посчитаем, сколько существует распределений,
    где ровно <!> подмножеств пусто.`,1),yn=_("Для красоты произведём замену <!>:",1),jn=_(`Сначала произведём замену <!>, <!>, а потом
    просуммируем по <!> обе части равенства и умножим на <!>.
    Теперь равенство имеет следующий вид:`,1),bn=_("Так как в правой сумме есть множитель <!>, то можно начинать сумму с <!>:",1),En=_("Сдвинем индексацию на один <!> и вынесем множитель из биномиального коэффициента.",1),Xn=_(`Можно сказать, что с этого мы и начинали.
    Теперь заменим правую часть равенства на <!> и получим:`,1),qn=_(`Одно из самых часто встречаемых свойств чисел Стирлинга это равенство,
    выражающее обычные степени <!> через нисходящие <!>.
    Выглядит оно так:`,1),zn=_(`Докажем по индукции <!>,
    потому что <!>,
    следовательно <!> это:`,1),Nn=_("<!> <!>",1),Hn=_(`Можно получить формулу, выражающую обычные степени <!> через возрастающие <!>.
    Чтобы это сделать, начнём с производящей функции:`,1),Sn=_("Произведём замену <!> и получим:",1),Bn=_(`Попробуем получить другую запись коэффициента <!>.
    Для этого воспользуемся следующей производящей функцией:`,1),Gn=_("Сделаем замену <!> и домножим на <!>:",1),On=_("Теперь можем подставить наше равенство как коэффициент <!>:",1),Rn=_("Последним штрихом будет производящая функция для <!>:",1),Fn=_(`Коэффициенты при <!> совпадают.
    Умножаем на <!> и получаем искомую формулу:`,1),Dn=_("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),Mn=_(`Числа Стирлинга нашли свое применение и в теории вероятностей.
    Многие дискретные распределения &mdash; в частности, биномиальное &mdash; связаны со счётом числа успехов,
    выборов, перестановок или комбинаций.
    В итоге выражения для моментов таких распределений неизбежно содержат суммы, в которых встречаются степени целых чисел,
    а обычные степени несложно превратить в возрастающие или нисходящие. Давайте рассмотрим один из таких случаев.
    Пусть случайная величина <!> имеет биномиальное распределение с параметрами <!> и <!>.`,1),Tn=_("Наша цель &mdash; получить явное аналитическое выражение для произвольного момента <!>.",1),wn=_(`В таком виде выражение не позволяет проследить зависимость момента от параметров <!> и <!>.
    Чтобы преобразовать его, необходимо заменить обычную степень <!> нисходящей степенью <!>,
    что приведёт к числам Стирлинга. Запишем нашу случайную величину с помощью чисел Стирлинга второго рода:`,1),An=_("Рассмотрим величину <!> . По определению",1),Cn=_("Вынесем <!> и сгруппируем степени вероятности.",1),Jn=_("Сделаем замену индекса <!>.",1),Kn=_(`Главный параметр распределения Пуассона &mdash; число <!>,
    которое одновременно является средним количеством событий и интенсивностью их появления.
    Случайная величина, имеющая распределение Пуассона с параметром <!>, обозначается как`,1),Ln=_("и принимает значения <!> с вероятностями:",1),Qn=_("Так как <!> при <!>, сумма начинается с <!>",1),Un=_("Поскольку <!>, имеем",1),Vn=_("Сделаем замену индекса <!> и получим",1),Wn=_("Так как <!>, получаем итоговую формулу:",1),Yn=_(`Таким образом, каждый момент распределения Пуассона является полиномом от <!>,
    а коэффициенты перед степенями <!> &mdash; это числа Стирлинга второго рода.`,1),Zn=_("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),ro=_(`<b>Число Стирлинга первого рода</b> <!> &mdash; число перестановок <!> объектов,
    содержащих ровно <!> циклов.`,1),no=_(`Подробно о циклических перестановках можно почитать в соответствующей статье.
    Простым языком, циклическая перестановка <!> переводит элемент с позиции <!> на
    позицию <!>, <!> &mdash; в <!>, <!> &mdash; в <!> и,
    наконец, <!> &mdash; в <!>. Отмечу: единичный цикл &mdash; это, по сути, то же самое, что и множество,
    состоящее из одного элемента. Аналогично 2-цикл подобен 2-множеству, потому что <!> &mdash;
    так же как и <!>. Однако имеется два разных 3-цикла: <!> и <!>.

    В общем случае из любого <!>-элементного множества можно составить <!> различных <!>-циклов.
    Таким образом:`,1),oo=_(`Это значительно больше величины <!>.
    Можно прийти к выводу, что каждое разбиение на непустые подмножества приводит как минимум к одному представлению в виде циклов. Значит:`,1),ao=_(`Рекуррентное соотношение для чисел Стирлинга первого рода можно получить, изменив рассуждения,
    использовавшиеся при выводе чисел Стирлинга второго рода.
    Каждое представление <!> объектов в виде <!> циклов либо помещает последний объект в отдельный цикл <!> способами,
    либо вставляет этот объект в одно <!> из циклических представлений первых <!> объектов.
    В последнем случае существует <!> различных способов выполнения такой вставки.
    Это не очевидно, однако нетрудно убедиться, что имеется <!> способов размещения нового элемента в <!>-цикл для получения <!>-цикла.
    Суммирование по всем <!> даёт в итоге <!> способов вставки <!>-ого объекта в
    циклическое разбиение <!> объектов. Таким образом, получаем рекуррентное соотношение:`,1),eo=_(`Посмотрим на связь циклов и некоторой перестановки <!>.
    Действительно, если начать с <!> и рассматривать <!>, <!>, и т.д., то в конце концов мы должны будем вернуться к <!>.
    Числа раньше или позже должны будут повториться, и первым числом, которое появится вновь,
    будет именно <!>, потому что мы знаем, что у других чисел <!> имеются собственные уникальные предшественники.
    Каждая перестановка определяет некоторое циклическое представление.
    И обратно, каждое циклическое представление очевидным образом определяет перестановку.
    Следовательно, если просуммировать все <!> по всем <!>,
    то должно получиться общее количество перестановок:`,1),to=_(`Рассуждения, используемые для чисел Стирлинга второго рода, применимы и для чисел Стирлинга первого рода.
    Возьмём перестановку из <!> элементов и вставим в неё <!>-й элемент:
    новый элемент может создать новый цикл или войти в уже существующий, не изменив их количества.
    Циклов, в которые мы можем добавить новый элемент, <!>,
    а способов создать новые циклы на <!> старых циклах существует <!>.
    Снова суммируем по <!>:`,1),_o=_("Итак, доминирующее число перестановок с ровно <!> двуциклами и остальными одноэлементными циклами равно",1),mo=_("Разложим факториальную часть при больших <!>:",1),vo=_(`Если же перестановка содержит цикл длины <!>,
    то в формировании непунктуальных циклов участвует меньше чем <!> элементов;
    следовательно, количество таких перестановок есть многочлен меньшей степени по <!>.
    Поэтому вклад таких перестановок оказывается <!>,
    и доминирует всё та же конфигурация из <!> двуциклов.
    Отсюда следует асимптотика:`,1),so=_(`Но узнать значение чисел Стирлинга первого рода мы можем и с помощью гармонических чисел.
    Для начала распишем рекурсивную формулу при <!>:`,1),io=_("Разделим обе части на <!>:",1),lo=_(`Введем последовательность: <!>.
    Тогда наша рекурсивная формула приобретает следующий вид:`,1),ko=_("Начальное условие <!>, тогда:",1),co=_(`Давайте выведем общую формулу. Это будет немного сложнее, но старания окупятся. Приступим, посмотрим на произведение,
    которое по сути является восходящей степенью <!>.
    Это можно записать сразу двумя способами: через биномиальные коэффициенты и через числа Стирлинга первого рода.`,1),po=_(`Запишем производящую функцию для чисел Стирлинга первого рода по степени переменной <!>.
    Эта формула показывает, что логарифмическая функция является их экспоненциальной производящей функцией.`,1),uo=_("Введём замену переменной <!>, чтобы избавиться от логарифма в правой части и получить экспоненту.",1),$o=_("Определим функцию <!>, которая естественным образом возникает после подстановки. Слева &mdash; аналитическая форма, справа &mdash; разложение через полиномиальные числа Бернулли.",1),fo=_("Теперь преобразуем знаменатель <!>, чтобы выразить его через числа Стирлинга первого рода.",1),Io=_("Подставим это разложение обратно в выражение для <!> и разложим экспоненту в степенной ряд &mdash; получим произведение двух рядов.",1),ho=_(`Сделаем замену индексов <!> и <!>,
    чтобы собрать коэффициенты при одинаковых степенях <!>.`,1),xo=_("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),Po=_(`Уже было много неожиданных равенств, добавим еще.
    Мы захотим записать восходящую степень <!> через обычные степени <!>,
    формула выглядит так:`,1),go=_(`Аналогично формуле для обычных степеней с числами Стирлинга второго рода,
    докажем по индукции <!>:`,1),yo=_("<!> <!>",1),jo=_(`Чтобы вывести следующую формулу, сделаем замену <!> и <!>.
    Потом разделим на <!>:`,1),bo=_("Запишем <!> через биномиальные коэффициенты:",1),Eo=_("Поменяем порядок суммирования и приравняем к изначальной формуле для <!>:",1),Xo=_("Сравниваем коэффициенты при <!> и получаем формулу:",1),qo=_(`Выведем формулу для нисходящих степеней <!> через обычные <!>,
    как и с числами Стирлинга второго рода, сделаем это с помощью производящих функций.
    Начнём с биномиальной формулы с обобщённым коэффициентом <!> и
    производящей функции для <!>:`,1),zo=_("Попробуем найти, чему равен коэффициент <!>. Посмотрим на другую экспоненциальную производящую функцию:",1),No=_(`Как мы делали при выводе формулы с числами Стирлинга второго рода, заменим <!> на <!> и
    умножим обе части на <!>:`,1),Ho=_("Отлично &mdash; теперь мы можем подставить значение <!> в наше равенство:",1),So=_(`Вернёмся к самому первому равенству, полученному для <!>.
    Так как серия по <!> единственная, то коэффициенты при <!> совпадают.
    Остаётся лишь умножить на <!> и получить желаемую формулу:`,1),Bo=_("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),Go=_("<!> <!> <!> <!> <!> <!> <!>",1),Oo=_("Наличие множителя <!> не дает воспользоваться производящей функцией напрямую, для этого сделаем замену:",1),Ro=_("Суммируя по <!> и меняя порядок суммирования и интегрирования, имеем",1),Fo=_("Домножим обе части на <!>, что допустимо при <!>:",1),Do=_("Сделаем замену переменной <!>, тогда <!>. Получаем",1),Mo=_("Так как <!> на интервале <!>, верно равенство",1),To=_("Подставляя это в выражение для <!>, получаем",1),wo=_("Интеграл в правой части вычисляется по известной формуле (её легко получить заменой <!>):",1),Ao=_("Суммируя по <!> и меняя порядок суммирования и интегрирования, получаем",1),Co=_("Подставляя <!> получаем",1),Jo=_("Отделяя множитель <!> приходим к",1),Ko=_("Так как на интервале <!> выполнено <!>, получаем",1),Lo=_("Разложим <!> в геометрический ряд и подставим его под знак интеграла",1),Qo=_("Интеграл в правой части вычисляется заменой <!>:",1),Uo=_("В нашем случае <!>, поэтому",1),Vo=_("При <!> имеем <!>, и формула вырождается в то, что мы уже выводили:",1),Wo=_("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1),Yo=_(`Используя две формулы:
    для обычных степеней <!> через восходящие степени <!> и для нисходящих степеней <!> через обычные степени <!>,
    можно получить следующее равенство:`,1),Zo=_(`Это справедливо при всех <!>,
    так что коэффициенты при <!> должны быть равны нулю,
    и мы получаем тождество:`,1),ra=_("Можно и наоборот. Для этого понадобятся формула для восходящих степеней <!> через обычные степени <!> и для обычных степеней <!> через восходящие <!>:",1),na=_("<!> <!> <!> <!> <!> <!>",1),oa=_(`Еще можно определить числа Стирлинга <!>, <!> для отрицательных <!>. Сделать это не сложно,
    так как у нас уже есть базовые рекуррентные соотношения. Нам нужно ввести дополнительные соглашения:`,1),aa=_("<!> <!> <!> <!>",1),ea=_("<!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!> <!>",1);function ga(tn){var Hr=ea(),Sr=d(Hr);mn(Sr,{title:"Числа Стирлинга"});var Br=r(Sr,2);ir(Br,{children:(S,W)=>{e(S,{children:(h,R)=>{o();var q=vn(),B=r(d(q));n(B,{m:"\\stirlI{n}{k}"});var z=r(B,2);n(z,{m:"\\stirlII{n}{k}"}),o(),a(h,q)}})}});var Gr=r(Br,2);Nr(Gr,{children:(S,W)=>{o();var h=u("Числа Стирлинга второго рода");a(S,h)}});var Or=r(Gr,2);en(Or,{title:"Числа Стирлинга второго рода",children:(S,W)=>{ir(S,{children:(h,R)=>{e(h,{children:(q,B)=>{var z=sn(),N=r(d(z),2);n(N,{m:"\\stirlII{n}{k}"});var F=r(N,2);n(F,{m:"n"});var j=r(F,2);n(j,{m:"k"}),o(),a(q,z)}})}})}});var Rr=r(Or,2);ir(Rr,{children:(S,W)=>{var h=pn(),R=d(h);e(R,{children:(j,G)=>{o();var x=ln(),I=r(d(x));n(I,{m:"0"});var M=r(I,2);n(M,{m:"0"}),o(),a(j,x)}});var q=r(R,2);n(q,{display:!0,m:"\\stirlII{n}{0} = [n = 0]"});var B=r(q,2);e(B,{children:(j,G)=>{o();var x=kn(),I=r(d(x));n(I,{m:"1"}),o(),a(j,x)}});var z=r(B,2);n(z,{display:!0,m:"\\stirlII{n}{1} = 1"});var N=r(z,2);e(N,{children:(j,G)=>{o();var x=cn(),I=r(d(x));n(I,{m:"2"});var M=r(I,2);n(M,{m:"n-1"});var K=r(M,2);n(K,{m:"2^{n-1}"}),o(),a(j,x)}});var F=r(N,2);n(F,{display:!0,m:"\\stirlII{n}{2} = 2^{n-1} - 1"}),a(S,h)}});var Fr=r(Rr,2);ir(Fr,{children:(S,W)=>{var h=Dn(),R=d(h);e(R,{children:(t,l)=>{o();var m=un(),s=r(d(m));n(s,{m:"\\stirlII{n-1}{k-1}"});var $=r(s,2);n($,{m:"n-1"});var E=r($,2);n(E,{m:"k \\cdot \\stirlII{n-1}{k}"});var D=r(E,2);n(D,{m:"\\stirlII{n-1}{k}"});var w=r(D,2);n(w,{m:"n-1"});var A=r(w,2);n(A,{m:"k"});var Q=r(A,2);n(Q,{m:"k"});var Y=r(Q,2);n(Y,{m:"n"}),o(),a(t,m)}});var q=r(R,2);n(q,{display:!0,m:"\\stirlII{n}{k} = k \\cdot \\stirlII{n-1}{k} + \\stirlII{n-1}{k-1}"});var B=r(q,2);e(B,{children:(t,l)=>{o();var m=$n(),s=r(d(m));n(s,{m:"\\stirlII{n+k}{n}"});var $=r(s,2);n($,{m:"n+k"});var E=r($,2);n(E,{m:"n"});var D=r(E,2);n(D,{m:"k"});var w=r(D,2);n(w,{m:"k"});var A=r(w,2);n(A,{m:"2k"}),o(),a(t,m)}});var z=r(B,2);n(z,{display:!0,m:"\\stirlII{n+k}{2k}"});var N=r(z,2);e(N,{children:(t,l)=>{o();var m=fn(),s=r(d(m));n(s,{m:"2k"});var $=r(s,2);n($,{m:"k"}),o(),a(t,m)}});var F=r(N,2);n(F,{display:!0,m:"(2k - 1)!! = \\frac{(2k)!}{2^k \\cdot k!}"});var j=r(F,2);e(j,{children:(t,l)=>{o();var m=In(),s=r(d(m));n(s,{m:"1"});var $=r(s,2);n($,{m:"2"}),o(),a(t,m)}});var G=r(j,2);n(G,{display:!0,m:"\\binom{n + k}{2k} \\cdot \\frac{(2k)!}{2^k k!} = \\frac{(n + k)!}{(n - k)!} \\cdot \\frac{1}{2^k k!}"});var x=r(G,2);e(x,{children:(t,l)=>{o();var m=hn(),s=r(d(m));n(s,{m:"n"}),o(),a(t,m)}});var I=r(x,2);n(I,{display:!0,m:"\\frac{(n + k)!}{(n - k)!} = (n - k + 1)(n - k + 2) \\dots (n + k) = n^{2k} \\left(1 + O\\left(\\frac{1}{n}\\right)\\right)"});var M=r(I,2);e(M,{children:(t,l)=>{o();var m=u("Отсюда получаем точную асимптотику:");a(t,m)}});var K=r(M,2);n(K,{display:!0,m:"\\binom{n + k}{2k} \\cdot (2k - 1)!! = \\frac{n^{2k}}{2^k k!} + O\\left(n^{2k - 1}\\right)"});var U=r(K,2);e(U,{children:(t,l)=>{o();var m=xn(),s=r(d(m));n(s,{m:"\\ge 3"});var $=r(s,2);n($,{m:"2k"});var E=r($,2);n(E,{m:"n"});var D=r(E,2);n(D,{m:"2k"});var w=r(D,2);n(w,{m:"O(n^{2k - 1})"});var A=r(w,2);n(A,{m:"k"}),o(),a(t,m)}});var Z=r(U,2);n(Z,{display:!0,m:"\\stirlII{n + k}{n} = \\frac{n^{2k}}{2^k k!} + O(n^{2k - 1}) \\sim \\frac{n^{2k}}{2^k \\cdot k!}"});var rr=r(Z,2);e(rr,{children:(t,l)=>{o();var m=Pn(),s=r(d(m));n(s,{m:"n+1"});var $=r(s,2);n($,{m:"m+1"});var E=r($,2);n(E,{m:"k+1"});var D=r(E,2);n(D,{m:"k"});var w=r(D,2);n(w,{m:"\\binom{n}{k}"});var A=r(w,2);n(A,{m:"n - k"});var Q=r(A,2);n(Q,{m:"m"});var Y=r(Q,2);n(Y,{m:"\\stirlII{n}{k}"});var yr=r(Y,2);n(yr,{m:"k"}),o(),a(t,m)}});var nr=r(rr,2);n(nr,{display:!0,m:"\\stirlII{n+1}{m+1} = \\sum_k \\binom{n}{k} \\stirlII{k}{m}"});var or=r(nr,2);e(or,{children:(t,l)=>{o();var m=gn(),s=r(d(m));n(s,{m:"m! \\stirlII{n}{m}"});var $=r(s,2);n($,{m:"n"});var E=r($,2);n(E,{m:"k"}),o(),a(t,m)}});var ar=r(or,2);n(ar,{display:!0,m:"\\binom{m}{k} \\cdot (m - k)^n"});var er=r(ar,2);e(er,{children:(t,l)=>{o();var m=u("По формуле включений–исключений:");a(t,m)}});var tr=r(er,2);n(tr,{display:!0,m:"m! \\cdot \\stirlII{n}{m} = \\sum_{k=0}^{m} (-1)^k \\cdot \\binom{m}{k}(m - k)^n"});var dr=r(tr,2);e(dr,{children:(t,l)=>{o();var m=yn(),s=r(d(m));n(s,{m:"k = m - k"}),o(),a(t,m)}});var _r=r(dr,2);n(_r,{display:!0,m:"m! \\cdot \\stirlII{n}{m} = \\sum_{k=0}^{m} \\binom{m}{k} k^n \\cdot (-1)^{m-k}"});var vr=r(_r,2);e(vr,{children:(t,l)=>{o();var m=u("Продолжим делать необычные преобразования. Для этого запишем формулу в виде:");a(t,m)}});var b=r(vr,2);n(b,{display:!0,m:"\\stirlII{n}{m} = \\frac{1}{m!} \\sum_{j=0}^{m} \\binom{m}{j} \\cdot j^n \\cdot (-1)^{m-j}"});var C=r(b,2);e(C,{children:(t,l)=>{o();var m=jn(),s=r(d(m));n(s,{m:"m = m+1"});var $=r(s,2);n($,{m:"n = k+1"});var E=r($,2);n(E,{m:"k"});var D=r(E,2);n(D,{m:"\\binom{n}{k} \\, (-1)^{n-k}"}),o(),a(t,m)}});var f=r(C,2);n(f,{display:!0,m:`
      \\sum_{k = 0}^{n} \\binom{n}{k} (-1)^{n-k} \\stirlII{k+1}{m+1} =
      \\sum_{k = 0}^{n} \\binom{n}{k} (-1)^{n-k} \\frac{1}{(m + 1)!} \\sum_{j = 0}^{m+1} (-1)^{m+1-j} \\binom{m+1}{j} \\, j^{k+1}
      `});var P=r(f,2);e(P,{children:(t,l)=>{o();var m=u("В правой части поменяем порядок суммирования и заметим свёртку биномиальной суммы.");a(t,m)}});var T=r(P,2);n(T,{display:!0,m:`\\align{
      \\sum_{k = 0}^{n} \\binom{n}{k} (-1)^{n-k} \\stirlII{k+1}{m+1} &=
      \\frac{1}{(m + 1)!} \\sum_{j = 0}^{m+1} (-1)^{m+1-j} \\binom{m+1}{j} \\, j \\sum_{k = 0}^{n} \\binom{n}{k} (-1)^{n-k}  \\cdot j^k \\\\
      &= \\frac{1}{(m + 1)!} \\sum_{j = 0}^{m+1} (-1)^{m+1-j} \\binom{m+1}{j} \\, j \\cdot (j-1)^n
      }`});var J=r(T,2);e(J,{children:(t,l)=>{o();var m=bn(),s=r(d(m));n(s,{m:"j"});var $=r(s,2);n($,{m:"j = 1"}),o(),a(t,m)}});var V=r(J,2);n(V,{display:!0,m:`\\align{
      \\sum_{k = 0}^{n} \\binom{n}{k} (-1)^{n-k} \\stirlII{k+1}{m+1}
      &= \\frac{1}{(m + 1)!} \\sum_{j = 1}^{m+1} (-1)^{m+1-j} \\binom{m+1}{j} \\, j \\cdot (j-1)^n
      }`});var mr=r(V,2);e(mr,{children:(t,l)=>{o();var m=En(),s=r(d(m));n(s,{m:"j = j + 1"}),o(),a(t,m)}});var sr=r(mr,2);n(sr,{display:!0,m:`\\align{
      \\sum_{k = 0}^{n} \\binom{n}{k} (-1)^{n-k} \\stirlII{k+1}{m+1}
      &= \\frac{1}{(m + 1)!} \\sum_{j = 0}^{m+1} (-1)^{m-j} \\binom{m+1}{j+1} \\, (j+1) \\cdot (j)^n = \\\\
      &= \\frac{1}{(m + 1)!} \\sum_{j = 0}^{m+1} (-1)^{m-j} \\cdot \\frac{m+1}{j+1} \\cdot \\binom{m}{j} \\, (j+1) \\cdot (j)^n = \\\\
      &= \\frac{1}{m!} \\sum_{j = 0}^{m+1} (-1)^{m-j} \\cdot\\binom{m}{j} \\cdot (j)^n
      }`});var lr=r(sr,2);e(lr,{children:(t,l)=>{o();var m=Xn(),s=r(d(m));n(s,{m:"\\stirlII{n}{m}"}),o(),a(t,m)}});var kr=r(lr,2);n(kr,{display:!0,m:`
      \\stirlII{n}{m} = \\sum_{k = 0}^{n} \\binom{n}{k}  \\stirlII{k+1}{m+1} (-1)^{n-k}
      `});var cr=r(kr,2);e(cr,{children:(t,l)=>{o();var m=qn(),s=r(d(m));n(s,{m:"x^n"});var $=r(s,2);n($,{m:"x^{\\underline{n}}"}),o(),a(t,m)}});var pr=r(cr,2);n(pr,{display:!0,m:"x^n = \\sum_{k=0}^n \\stirlII{n}{k} \\, x^{\\underline{k}} \\quad{где}\\ ~n \\in \\NN_0"});var ur=r(pr,2);an(ur,{children:(t,l)=>{var m=Nn(),s=d(m);e(s,{children:(E,D)=>{o();var w=zn(),A=r(d(w));n(A,{m:"x \\cdot x^{\\underline{k}} = x^{\\underline{k+1}} + k \\cdot x^{\\underline{k}}"});var Q=r(A,2);n(Q,{m:"x^{\\underline{k+1}} = x^{\\underline{k}} \\cdot (x - k)"});var Y=r(Q,2);n(Y,{m:"x \\cdot x^{\\underline{n-1}}"}),o(),a(E,w)}});var $=r(s,2);n($,{display:!0,m:`\\align{
      x \\cdot \\sum_{k} \\stirlII{n-1}{k} \\, x^{\\underline{k}} &=
      \\sum_{k} \\stirlII{n-1}{k} \\, x^{\\underline{k+1}} \\, + \\sum_{k} \\stirlII{n-1}{k} \\, k  x^{\\underline{k}} \\\\
      &= \\sum_{k} \\stirlII{n-1}{k-1} \\, x^{\\underline{k}} \\, + \\sum_{k} \\stirlII{n-1}{k} \\, k  x^{\\underline{k}} \\\\
      &= \\sum_{k} \\left( k \\cdot \\stirlII{n-1}{k} + \\stirlII{n-1}{k-1} \\right) x^{\\underline{k}}
      = \\sum_{k} \\stirlII{n}{k} x^{\\underline{k}}
      }`}),a(t,m)}});var $r=r(ur,2);e($r,{children:(t,l)=>{o();var m=Hn(),s=r(d(m));n(s,{m:"x^n"});var $=r(s,2);n($,{m:"x^{\\underline{n}}"}),o(),a(t,m)}});var fr=r($r,2);n(fr,{display:!0,m:`
      \\sum_{k=0}^{\\oo} \\frac{x^{\\overline{k}}}{k!} p^k = (1 - p)^{-x}
      `});var Ir=r(fr,2);e(Ir,{children:(t,l)=>{o();var m=Sn(),s=r(d(m));n(s,{m:"p = 1 - e^{-t}"}),o(),a(t,m)}});var hr=r(Ir,2);n(hr,{display:!0,m:`
      \\sum_{k=0}^{\\oo} \\frac{x^{\\overline{k}}}{k!} (1 - e^{-t})^k = (1 - (1 - e^{-t}))^{-x} =e^{xt}
      `});var xr=r(hr,2);e(xr,{children:(t,l)=>{o();var m=Bn(),s=r(d(m));n(s,{m:"(1 - e^{-t})^k / k!"}),o(),a(t,m)}});var Pr=r(xr,2);n(Pr,{display:!0,m:`
      \\sum_{n=k}^{\\oo} \\stirlII{n}{k} \\, \\frac{t^n}{n!} = \\frac{(e^t - 1)^k}{k!}
      `});var gr=r(Pr,2);e(gr,{children:(t,l)=>{o();var m=Gn(),s=r(d(m));n(s,{m:"t = -t"});var $=r(s,2);n($,{m:"(-1)^k"}),o(),a(t,m)}});var p=r(gr,2);n(p,{display:!0,m:`
      \\sum_{n=k}^{\\oo} \\stirlII{n}{k} \\, \\frac{(-1)^{n-k} \\, t^n}{n!} = \\frac{(1 - e^{-t})^k}{k!}
      `});var H=r(p,2);e(H,{children:(t,l)=>{o();var m=On(),s=r(d(m));n(s,{m:"(1 - e^{-t})^k / k!"}),o(),a(t,m)}});var k=r(H,2);n(k,{display:!0,m:`
      e^{xt} = \\sum_{k=0}^{\\oo} x^{\\overline{k}} \\Bigg( \\sum_{n=k}^{\\oo} \\stirlII{n}{k} \\, \\frac{(-1)^{n-k} \\, t^n}{n!} \\Bigg) =
       \\sum_{k=0}^{\\oo} \\sum_{n=k}^{\\oo} \\stirlII{n}{k} \\, \\frac{(-1)^{n-k} \\, t^n}{n!} x^{\\overline{k}} =
       \\sum_{n=0}^{\\oo} \\frac{t^n}{n!} \\sum_{k = 0}^{n} \\stirlII{n}{k} \\, (-1)^{n-k}  x^{\\overline{k}}
      `});var g=r(k,2);e(g,{children:(t,l)=>{o();var m=Rn(),s=r(d(m));n(s,{m:"e^{xt}"}),o(),a(t,m)}});var L=r(g,2);n(L,{display:!0,m:`
      \\sum_{n=0}^{\\oo} \\frac{t^n}{n!} x^n  = e^{xt}
      `});var c=r(L,2);e(c,{children:(t,l)=>{o();var m=Fn(),s=r(d(m));n(s,{m:"t^n"});var $=r(s,2);n($,{m:"n!"}),o(),a(t,m)}});var O=r(c,2);n(O,{display:!0,m:"x^n  = \\sum_{k = 0}^{n} \\stirlII{n}{k} \\, (-1)^{n-k}  x^{\\overline{k}}"}),a(S,h)}});var Dr=r(Fr,2);ir(Dr,{children:(S,W)=>{var h=Zn(),R=d(h);e(R,{children:(p,H)=>{o();var k=Mn(),g=r(d(k));n(g,{m:"X"});var L=r(g,2);n(L,{m:"n"});var c=r(L,2);n(c,{m:"p"}),o(),a(p,k)}});var q=r(R,2);n(q,{display:!0,m:"P(X = k) = \\binom{n}{k} p^k (1-p)^{n-k} \\quad{где} \\ ~k = 0, 1, \\dots, n"});var B=r(q,2);e(B,{children:(p,H)=>{o();var k=Tn(),g=r(d(k));n(g,{m:"\\EE[X^m]"}),o(),a(p,k)}});var z=r(B,2);n(z,{display:!0,m:"\\EE[X^m] = \\sum_{k=0}^{n} k^m \\binom{n}{k} p^k (1-p)^{n-k}"});var N=r(z,2);e(N,{children:(p,H)=>{o();var k=wn(),g=r(d(k));n(g,{m:"n"});var L=r(g,2);n(L,{m:"p"});var c=r(L,2);n(c,{m:"k^m"});var O=r(c,2);n(O,{m:"k^{\\underline{m}}"}),o(),a(p,k)}});var F=r(N,2);n(F,{display:!0,m:"X^m = \\sum_{r=0}^{m} \\stirlII{m}{r} \\, X^{\\underline{r}}"});var j=r(F,2);e(j,{children:(p,H)=>{o();var k=u("Так как математическое ожидание линейно, можем записать:");a(p,k)}});var G=r(j,2);n(G,{display:!0,m:"\\EE[X^m] = \\sum_{r=0}^{m} \\stirlII{m}{r} \\, \\EE[X^{\\underline{r}}]"});var x=r(G,2);e(x,{children:(p,H)=>{o();var k=u(`Таким образом,
    вычисление обычного момента сводится к нахождению моментов с ниcходящей степенью биномиального распределения.`);a(p,k)}});var I=r(x,2);e(I,{children:(p,H)=>{o();var k=An(),g=r(d(k));n(g,{m:"X^{\\underline{r}} = X(X-1) \\dots (X-r+1)"}),o(),a(p,k)}});var M=r(I,2);n(M,{display:!0,m:`
      \\EE[X^{\\underline{r}}] = \\sum_{k=0}^{n} k^{\\underline{r}} \\binom{n}{k} p^k (1-p)^{n-k}
      `});var K=r(M,2);e(K,{children:(p,H)=>{o();var k=u("Воспользуемся следующим комбинаторным тождеством:");a(p,k)}});var U=r(K,2);n(U,{display:!0,m:"k^{\\underline{r}} \\binom{n}{k} = n^{\\underline{r}} \\binom{n-r}{k-r}"});var Z=r(U,2);e(Z,{children:(p,H)=>{o();var k=u("Подставим это тождество.");a(p,k)}});var rr=r(Z,2);n(rr,{display:!0,m:"\\EE[X^{\\underline{r}}] = \\sum_{k=r}^{n} n^{\\underline{r}} \\binom{n-r}{k-r} p^k (1-p)^{n-k}"});var nr=r(rr,2);e(nr,{children:(p,H)=>{o();var k=Cn(),g=r(d(k));n(g,{m:"n^{\\underline{r}}"}),o(),a(p,k)}});var or=r(nr,2);n(or,{display:!0,m:`
      \\EE[X^{\\underline{r}}]
      = n^{\\underline{r}} \\cdot p^r \\cdot \\sum_{k=r}^{n} \\binom{n-r}{k-r} p^{k-r} (1-p)^{(n-r)-(k-r)}
      `});var ar=r(or,2);e(ar,{children:(p,H)=>{o();var k=Jn(),g=r(d(k));n(g,{m:"j = k - r"}),o(),a(p,k)}});var er=r(ar,2);n(er,{display:!0,m:"\\sum_{j=0}^{n-r} \\binom{n-r}{j} p^{j} (1-p)^{(n-r)-j} = (p + (1-p))^{n-r} = 1"});var tr=r(er,2);e(tr,{children:(p,H)=>{o();var k=u("Получаем компактную формулу факториального момента.");a(p,k)}});var dr=r(tr,2);n(dr,{display:!0,m:"\\EE[X^{\\underline{r}}] = n^{\\underline{r}} \\cdot p^r"});var _r=r(dr,2);e(_r,{children:(p,H)=>{o();var k=u("Подставляя найденное выражение факториальных моментов в нашу формулу, получаем итоговое выражение.");a(p,k)}});var vr=r(_r,2);n(vr,{display:!0,m:"\\EE[X^m] = \\sum_{r=0}^{m} \\stirlII{m}{r} \\, n^{\\underline{r}} \\cdot p^r"});var b=r(vr,2);e(b,{children:(p,H)=>{o();var k=u("Это — общее замкнутое выражение для произвольного момента биномиальной случайной величины.");a(p,k)}});var C=r(b,2);e(C,{children:(p,H)=>{o();var k=u(`Теперь поговорим о распределении Пуасона.
    Оно занимает особое место в теории вероятностей.
    Это распределение описывает количество редких событий за фиксированное время или в фиксированной области:
    число аварий на перекрёстке за день, число звонков в колл-центр за минуту,
    количество радиоактивных распадов за интервал наблюдения и еще большой спектр случаев.`);a(p,k)}});var f=r(C,2);e(f,{children:(p,H)=>{o();var k=Kn(),g=r(d(k));n(g,{m:"\\lambda > 0"});var L=r(g,2);n(L,{m:"\\lambda"}),o(),a(p,k)}});var P=r(f,2);n(P,{display:!0,m:"X \\sim \\mathrm{Poisson}(\\lambda)"});var T=r(P,2);e(T,{children:(p,H)=>{o();var k=Ln(),g=r(d(k));n(g,{m:"0,1,2,\\dots"}),o(),a(p,k)}});var J=r(T,2);n(J,{display:!0,m:"P (X = m) = e^{-\\lambda} \\cdot \\frac{\\lambda^m}{m!} \\quad{где} \\ ~m = 0,1,2,\\dots"});var V=r(J,2);e(V,{children:(p,H)=>{o();var k=u(`Теперь вычислим математическое ожидание нисходящей степени случайной величины Пуассона,
    как делали это в биномиальном распределении. По определению`);a(p,k)}});var mr=r(V,2);n(mr,{display:!0,m:"\\EE[X^{\\underline{k}}] = \\sum_{m=0}^{\\oo} m^{\\underline{k}} \\, P(X = m)"});var sr=r(mr,2);e(sr,{children:(p,H)=>{o();var k=Qn(),g=r(d(k));n(g,{m:"m^{\\underline{k}} = 0"});var L=r(g,2);n(L,{m:"m < k"});var c=r(L,2);n(c,{m:"m = k"}),a(p,k)}});var lr=r(sr,2);n(lr,{display:!0,m:`
      \\EE[X^{\\underline{k}}] = \\sum_{m=k}^{\\oo} m^{\\underline{k}} \\cdot e^{-\\lambda} \\cdot \\frac{\\lambda^m}{m!}
      `});var kr=r(lr,2);e(kr,{children:(p,H)=>{o();var k=Un(),g=r(d(k));n(g,{m:"m^{\\underline{k}} = m! / (m-k)!"}),o(),a(p,k)}});var cr=r(kr,2);n(cr,{display:!0,m:`
      \\EE[X^{\\underline{k}}] = e^{-\\lambda} \\sum_{m=k}^{\\oo} \\frac{\\lambda^m}{(m-k)!}
      `});var pr=r(cr,2);e(pr,{children:(p,H)=>{o();var k=Vn(),g=r(d(k));n(g,{m:"j = m - k"}),o(),a(p,k)}});var ur=r(pr,2);n(ur,{display:!0,m:`
      \\EE[X^{\\underline{k}}] = e^{-\\lambda} \\sum_{j=0}^{\\oo} \\frac{\\lambda^{j+k}}{j!} =
      e^{-\\lambda} \\cdot \\lambda^k \\sum_{j=0}^{\\oo} \\frac{\\lambda^j}{j!} =
      e^{-\\lambda} \\cdot \\lambda^k \\cdot e^{\\lambda} = \\lambda^k
      `});var $r=r(ur,2);e($r,{children:(p,H)=>{o();var k=u("Итак, моменты с нисходящей степенью распределения Пуассона имеют следующую форму:");a(p,k)}});var fr=r($r,2);n(fr,{display:!0,m:"\\EE[X^{\\underline{k}}] = \\lambda^k"});var Ir=r(fr,2);e(Ir,{children:(p,H)=>{o();var k=u("Теперь выразим обычные степени через нисходящие и воспользуемся линейностью математического ожидания:");a(p,k)}});var hr=r(Ir,2);n(hr,{display:!0,m:`
      \\EE[X^n] = \\sum_{k=0}^{n} \\stirlII{n}{k} \\, \\EE[X^{\\underline{k}}]
      `});var xr=r(hr,2);e(xr,{children:(p,H)=>{o();var k=Wn(),g=r(d(k));n(g,{m:"\\EE[X^{\\underline{k}}] = \\lambda^k"}),o(),a(p,k)}});var Pr=r(xr,2);n(Pr,{display:!0,m:"\\EE[X^n] = \\sum_{k=0}^{n} \\stirlII{n}{k} \\, \\lambda^k"});var gr=r(Pr,2);e(gr,{children:(p,H)=>{o();var k=Yn(),g=r(d(k));n(g,{m:"\\lambda"});var L=r(g,2);n(L,{m:"\\lambda^k"}),o(),a(p,k)}}),a(S,h)}});var Mr=r(Dr,2);Nr(Mr,{children:(S,W)=>{o();var h=u("Числа Стирлинга первого рода");a(S,h)}});var Tr=r(Mr,2);en(Tr,{title:"Числа Стирлинга первого рода",children:(S,W)=>{ir(S,{children:(h,R)=>{e(h,{children:(q,B)=>{var z=ro(),N=r(d(z),2);n(N,{m:"\\stirlI{n}{k}"});var F=r(N,2);n(F,{m:"n"});var j=r(F,2);n(j,{m:"k"}),o(),a(q,z)}})}})}});var wr=r(Tr,2);ir(wr,{children:(S,W)=>{var h=xo(),R=d(h);e(R,{children:(c,O)=>{o();var t=no(),l=r(d(t));n(l,{m:"(1, 3, 2, 4)"});var m=r(l,2);n(m,{m:"1"});var s=r(m,2);n(s,{m:"3"});var $=r(s,2);n($,{m:"3"});var E=r($,2);n(E,{m:"2"});var D=r(E,2);n(D,{m:"2"});var w=r(D,2);n(w,{m:"4"});var A=r(w,2);n(A,{m:"4"});var Q=r(A,2);n(Q,{m:"1"});var Y=r(Q,2);n(Y,{m:"(1, 2) = (2, 1)"});var yr=r(Y,2);n(yr,{m:"\\{1, 2 \\} = \\{2, 1 \\}"});var br=r(yr,2);n(br,{m:"(1, 2, 3)"});var Er=r(br,2);n(Er,{m:"(1, 3, 2)"});var Xr=r(Er,2);n(Xr,{m:"n"});var qr=r(Xr,2);n(qr,{m:"n!/n = (n - 1)!"});var zr=r(qr,2);n(zr,{m:"n"}),o(),a(c,t)}});var q=r(R,2);n(q,{display:!0,m:"\\stirlI{n}{1} = (n-1)! \\quad{где} ~ \\ ~n \\in \\NN "});var B=r(q,2);e(B,{children:(c,O)=>{o();var t=oo(),l=r(d(t));n(l,{m:"\\stirlII{n}{1} = 1"}),o(),a(c,t)}});var z=r(B,2);n(z,{display:!0,m:"\\stirlI{n}{k} \\ge \\stirlII{n}{k} \\quad{где} \\ ~n,k \\in \\NN_0 "});var N=r(z,2);e(N,{children:(c,O)=>{o();var t=u("Аналогично числам Стирлинга второго рода существует только один способ разделить множество на ноль циклов. Поэтому верно:");a(c,t)}});var F=r(N,2);n(F,{display:!0,m:"\\stirlI{n}{0} = [n = 0]"});var j=r(F,2);e(j,{children:(c,O)=>{o();var t=ao(),l=r(d(t));n(l,{m:"n"});var m=r(l,2);n(m,{m:"k"});var s=r(m,2);n(s,{m:"\\stirlI{n-1}{k-1}"});var $=r(s,2);n($,{m:"\\stirlI{n-1}{k}"});var E=r($,2);n(E,{m:"n-1"});var D=r(E,2);n(D,{m:"n-1"});var w=r(D,2);n(w,{m:"j"});var A=r(w,2);n(A,{m:"j"});var Q=r(A,2);n(Q,{m:"j+1"});var Y=r(Q,2);n(Y,{m:"j"});var yr=r(Y,2);n(yr,{m:"n-1"});var br=r(yr,2);n(br,{m:"n"});var Er=r(br,2);n(Er,{m:"n-1"}),o(),a(c,t)}});var G=r(j,2);n(G,{display:!0,m:`
      \\stirlI{n}{k} = (n-1) \\cdot \\stirlI{n-1}{k} + \\stirlI{n-1}{k-1} \\quad{где} \\ ~n \\in \\NN
      `});var x=r(G,2);e(x,{children:(c,O)=>{o();var t=eo(),l=r(d(t));n(l,{m:"\\alpha = (p_1, p_2, \\dotsc , p_m)"});var m=r(l,2);n(m,{m:"m_0 = m"});var s=r(m,2);n(s,{m:"m_1 = p_{m_0}"});var $=r(s,2);n($,{m:"m_2 = p_{m_1}"});var E=r($,2);n(E,{m:"m_k = m_0"});var D=r(E,2);n(D,{m:"m_0"});var w=r(D,2);n(w,{m:"p_1, p_2, \\dotsc , p_m"});var A=r(w,2);n(A,{m:"\\stirlI{n}{k}"});var Q=r(A,2);n(Q,{m:"k"}),o(),a(c,t)}});var I=r(x,2);n(I,{display:!0,m:"\\sum_{k=0}^{n} \\stirlI{n}{k} = n! \\quad{где} \\ ~n \\in \\NN"});var M=r(I,2);e(M,{children:(c,O)=>{o();var t=to(),l=r(d(t));n(l,{m:"n"});var m=r(l,2);n(m,{m:"n+1"});var s=r(m,2);n(s,{m:"\\stirlI{n}{k}"});var $=r(s,2);n($,{m:"m"});var E=r($,2);n(E,{m:"\\binom{k}{m}"});var D=r(E,2);n(D,{m:"k"}),o(),a(c,t)}});var K=r(M,2);n(K,{display:!0,m:"\\stirlI{n+1}{m+1} = \\sum_k \\binom{n}{k} \\stirlI{k}{m}"});var U=r(K,2);e(U,{children:(c,O)=>{o();var t=_o(),l=r(d(t));n(l,{m:"k"}),o(),a(c,t)}});var Z=r(U,2);n(Z,{display:!0,m:"\\binom{n + k}{2k} \\cdot (2k - 1)!! = \\binom{n + k}{2k} \\cdot \\frac{(2k)!}{2^k k!}"});var rr=r(Z,2);e(rr,{children:(c,O)=>{o();var t=mo(),l=r(d(t));n(l,{m:"n"}),o(),a(c,t)}});var nr=r(rr,2);n(nr,{display:!0,m:`
      \\frac{(n + k)!}{(n - k)!} = (n - k + 1)(n - k + 2) \\dots (n + k) =
       n^{2k}\\Bigl(1 + O\\!\\bigl(\\tfrac{1}{n}\\bigr)\\Bigr)
       `});var or=r(nr,2);e(or,{children:(c,O)=>{o();var t=u("Отсюда получаем точную асимптотику:");a(c,t)}});var ar=r(or,2);n(ar,{display:!0,m:"\\binom{n + k}{2k} \\cdot (2k - 1)!! = \\frac{n^{2k}}{2^k k!} + O(n^{2k - 1})"});var er=r(ar,2);e(er,{children:(c,O)=>{o();var t=vo(),l=r(d(t));n(l,{m:"\\ge 3"});var m=r(l,2);n(m,{m:"2k"});var s=r(m,2);n(s,{m:"n"});var $=r(s,2);n($,{m:"O(n^{2k - 1})"});var E=r($,2);n(E,{m:"k"}),o(),a(c,t)}});var tr=r(er,2);n(tr,{display:!0,m:"\\stirlI{n+k}{n} = \\frac{n^{2k}}{2^k k!} + O(n^{2k - 1}) \\sim \\frac{n^{2k}}{2^k k!}"});var dr=r(tr,2);e(dr,{children:(c,O)=>{o();var t=so(),l=r(d(t));n(l,{m:"k = 2"}),o(),a(c,t)}});var _r=r(dr,2);n(_r,{display:!0,m:`
      \\stirlI{n+1}{2} = n \\stirlI{n}{2} + (n-1)!
      `});var vr=r(_r,2);e(vr,{children:(c,O)=>{o();var t=io(),l=r(d(t));n(l,{m:"n!"}),o(),a(c,t)}});var b=r(vr,2);n(b,{display:!0,m:`
      \\stirlI{n+1}{2} \\cdot \\frac{1}{n!} = \\stirlI{n}{2} \\cdot \\frac{1}{(n-1)!} + \\frac{1}{n}
      `});var C=r(b,2);e(C,{children:(c,O)=>{o();var t=lo(),l=r(d(t));n(l,{m:"a_n = \\stirlI{n+1}{2} / n!"}),o(),a(c,t)}});var f=r(C,2);n(f,{display:!0,m:`
      a_n = a_{n-1} + \\frac{1}{n}
      `});var P=r(f,2);e(P,{children:(c,O)=>{o();var t=ko(),l=r(d(t));n(l,{m:"a_1 = 1"}),o(),a(c,t)}});var T=r(P,2);n(T,{display:!0,m:`
      a_n = 1 + \\sum_{k=2}^{n} \\frac{1}{k} = H_n
      `});var J=r(T,2);e(J,{children:(c,O)=>{o();var t=u("Подставляем обратно и получаем формулу, связывающую гармонические числа и числа Стирлинга первого порядка.");a(c,t)}});var V=r(J,2);n(V,{display:!0,m:`
      \\stirlI{n+1}{2} = n! \\cdot H_n
      `});var mr=r(V,2);e(mr,{children:(c,O)=>{o();var t=co(),l=r(d(t));n(l,{m:"(x+1)^{\\overline{n+1}}"}),o(),a(c,t)}});var sr=r(mr,2);e(sr,{children:(c,O)=>{o();var t=po(),l=r(d(t));n(l,{m:"x"}),o(),a(c,t)}});var lr=r(sr,2);n(lr,{display:!0,m:`
      \\sum_{n=k}^{\\infty} \\stirlI{n}{k} \\frac{x^n}{n!}
      = \\frac{1}{n!} \\left( \\ln(1 + x) \\right)^k
      `});var kr=r(lr,2);e(kr,{children:(c,O)=>{o();var t=u("Продифференцируем обе части.");a(c,t)}});var cr=r(kr,2);n(cr,{display:!0,m:`
      \\sum_{n=k}^{\\infty} \\stirlI{n + 1}{k + 1} \\frac{x^n}{n!}
      = \\frac{1}{(k + 1)!} \\left( \\ln(1 + x) \\right)^{k + 1}
      `});var pr=r(cr,2);e(pr,{children:(c,O)=>{o();var t=uo(),l=r(d(t));n(l,{m:"x = e^{-t} - 1"}),o(),a(c,t)}});var ur=r(pr,2);n(ur,{display:!0,m:`
      \\sum_{n=k}^{\\infty} \\stirlI{n + 1}{k + 1} \\frac{(e^{-t} - 1)^n}{n!}
      = \\frac{(-t)^{k + 1}}{(k + 1)!}
      `});var $r=r(ur,2);e($r,{children:(c,O)=>{o();var t=$o(),l=r(d(t));n(l,{m:"F(t)"}),o(),a(c,t)}});var fr=r($r,2);n(fr,{display:!0,m:`
      F(t) = \\left( \\frac{t}{e^t - 1} \\right)^{k+1} \\cdot e^{-H_n t}
      = \\sum_{m=0}^{\\infty} B_m^{(k+1)}(-H_n) \\frac{t^m}{m!}
      `});var Ir=r(fr,2);e(Ir,{children:(c,O)=>{o();var t=fo(),l=r(d(t));n(l,{m:"(e^t - 1)^{k+1} "}),o(),a(c,t)}});var hr=r(Ir,2);n(hr,{display:!0,m:`
      \\frac{1}{(e^t - 1)^{k+1}} = \\frac{1}{t^{k+1}} \\sum_{m=0}^{\\infty} \\stirlI{m + k + 1}{k + 1} \\frac{t^m}{(m + k + 1)!}
      `});var xr=r(hr,2);e(xr,{children:(c,O)=>{o();var t=Io(),l=r(d(t));n(l,{m:"F(t)"}),o(),a(c,t)}});var Pr=r(xr,2);n(Pr,{display:!0,m:`\\align{
      F(t) &= t^{k+1} e^{-H_n t} \\cdot \\frac{1}{t^{k+1}} \\sum_{m=0}^{\\infty} \\stirlI{m + k + 1}{k + 1} \\frac{t^m}{(m + k + 1)!} = \\\\
      &= \\sum_{i=0}^{\\infty} (-1)^i (H_n)^i \\frac{t^i}{i!} \\sum_{m=0}^{\\infty} \\stirlI{m + k + 1}{k + 1} \\frac{t^m}{(m + k + 1)!} =\\\\
      &= \\sum_{m=0}^{\\infty} \\sum_{j=0}^{\\infty} (-1)^j (H_n)^j \\, \\stirlI{m + k + 1}{k + 1} \\frac{t^m}{(m + k + 1)! \\, j!}
      }`});var gr=r(Pr,2);e(gr,{children:(c,O)=>{o();var t=ho(),l=r(d(t));n(l,{m:"n = m + j"});var m=r(l,2);n(m,{m:"m = n - j"});var s=r(m,2);n(s,{m:"t^n"}),o(),a(c,t)}});var p=r(gr,2);n(p,{display:!0,m:`
      F(t) = \\sum_{n=0}^{\\infty} \\sum_{j=0}^{n} (-1)^j (H_n)^j \\stirlI{\\,n - j + k + 1\\,}{k + 1} \\frac{t}{j! \\,(n - j + k + 1)!}
      `});var H=r(p,2);e(H,{children:(c,O)=>{o();var t=u("Теперь выражаем коэффициенты ряда — полиномиальные числа Бернулли — через числа Стирлинга первого рода и гармонические числа.");a(c,t)}});var k=r(H,2);n(k,{display:!0,m:`
      B_k^{(k+1)}(-H_n) = n! \\sum_{j=0}^{n} (-1)^j (H_n)^j \\stirlI{\\,n - j + k + 1\\,}{k + 1} \\frac{1}{j! \\,(n - j + k + 1)!}
      `});var g=r(k,2);e(g,{children:(c,O)=>{o();var t=u("Получаем обратное тождество, выражающее числа Стирлинга первого рода через полиномиальные числа Бернулли.");a(c,t)}});var L=r(g,2);n(L,{display:!0,m:`
      \\stirlI{n + 1}{k + 1} = \\frac{n!}{k!} \\sum_{j=0}^{k} (-1)^j \\binom{k}{j} B_{k - j}^{(k+1)} (-H_n) \\cdot (H_n)^j
      `}),a(S,h)}});var Ar=r(wr,2);ir(Ar,{children:(S,W)=>{var h=Bo(),R=d(h);e(R,{children:(b,C)=>{o();var f=Po(),P=r(d(f));n(P,{m:"x^{\\underline{n}}"});var T=r(P,2);n(T,{m:"x^n"}),o(),a(b,f)}});var q=r(R,2);n(q,{display:!0,m:"x^{\\overline{n}} = \\sum_{k=0}^n \\stirlI{n}{k} x^k \\quad{где} \\ ~n \\in \\NN_0"});var B=r(q,2);an(B,{children:(b,C)=>{var f=yo(),P=d(f);e(P,{children:(J,V)=>{o();var mr=go(),sr=r(d(mr));n(sr,{m:"x^{\\overline{k}} = x^{\\overline{k-1}} \\cdot (n + k)"}),o(),a(J,mr)}});var T=r(P,2);n(T,{display:!0,m:`\\align{
      (x+n-1) \\cdot \\sum_{k=0}^{n-1} \\stirlI{n-1}{k} x^k &=
      \\sum_{k=1}^{n} \\stirlI{n-1}{k-1} x^k + (n-1) \\cdot \\sum_{k=0}^{n-1} \\stirlI{n-1}{k} x^k = \\\\
      &= \\sum_{k=1}^{n-1} \\left( \\stirlI{n-1}{k-1} + (n - 1) \\cdot \\stirlI{n-1}{k} \\right) x^k
      + \\stirlI{n-1}{n-1} x^{n} + (n-1) \\cdot \\stirlI{n-1}{0} x^0 = \\\\
      &= \\sum_{k=1}^{n-1} \\stirlI{n}{k} x^k + x^{n} + 0 = \\sum_{k=0}^n \\stirlI{n}{k} x^k
      }`}),a(b,f)}});var z=r(B,2);e(z,{children:(b,C)=>{o();var f=jo(),P=r(d(f));n(P,{m:"n = n + 1"});var T=r(P,2);n(T,{m:"x = x - 1"});var J=r(T,2);n(J,{m:"(x - 1)"}),o(),a(b,f)}});var N=r(z,2);n(N,{display:!0,m:`
      x^{\\overline{n}} = \\sum_{k=0}^{n} \\stirlI{n+1}{k+1}(x-1)^k
      `});var F=r(N,2);e(F,{children:(b,C)=>{o();var f=bo(),P=r(d(f));n(P,{m:"(x - 1)^k"}),o(),a(b,f)}});var j=r(F,2);n(j,{display:!0,m:`
      x^{\\overline{n}} = \\sum_{k=0}^{n} \\stirlI{n+1}{k+1} \\sum_{m=0}^{k} \\binom{n}{m} x^m \\cdot (-1)^{k-m}
      `});var G=r(j,2);e(G,{children:(b,C)=>{o();var f=Eo(),P=r(d(f));n(P,{m:"x^{\\overline{n}}"}),o(),a(b,f)}});var x=r(G,2);n(x,{display:!0,m:`
      \\sum_{m=0}^n \\stirlI{n}{m} x^m = \\sum_{m=0}^{n} \\Bigg( \\sum_{k=m}^{k} \\stirlI{n+1}{k+1} \\binom{n}{m}  \\cdot (-1)^{k-m} \\Bigg) x^m
      `});var I=r(x,2);e(I,{children:(b,C)=>{o();var f=Xo(),P=r(d(f));n(P,{m:"x^m"}),o(),a(b,f)}});var M=r(I,2);n(M,{display:!0,m:`
      \\stirlI{n}{m} = \\sum_{k=m}^{k} \\stirlI{n+1}{k+1} \\binom{n}{m}  \\cdot (-1)^{k-m}
      `});var K=r(M,2);e(K,{children:(b,C)=>{o();var f=qo(),P=r(d(f));n(P,{m:"x^{\\underline{k}}"});var T=r(P,2);n(T,{m:"x^n"});var J=r(T,2);n(J,{m:"\\binom{x}{n} = x^{\\underline{n}} / n!"});var V=r(J,2);n(V,{m:"(1 + t)^x"}),o(),a(b,f)}});var U=r(K,2);n(U,{display:!0,m:`
      (1 + t)^x = \\sum_{n \\ge 0} \\binom{x}{n} t^n = \\sum_{n \\ge 0} \\frac{x^{\\underline{n}}}{n!} t^n
      `});var Z=r(U,2);e(Z,{children:(b,C)=>{o();var f=u("С другой стороны:");a(b,f)}});var rr=r(Z,2);n(rr,{display:!0,m:`
      (1 + t)^x = e^{x \\ln{(1 + t)}} = \\sum_{n=0}^{\\oo} \\frac{x^n}{n!} (\\ln{(1 + t)})^n
      `});var nr=r(rr,2);e(nr,{children:(b,C)=>{o();var f=zo(),P=r(d(f));n(P,{m:"(\\ln{(1 + t)})^n / n!"}),o(),a(b,f)}});var or=r(nr,2);n(or,{display:!0,m:`
      \\sum_{n=k}^{\\oo} \\stirlI{n}{k} \\frac{t^n}{n!} = \\frac{1}{k!} (-\\ln{(1 - t)})^k
      `});var ar=r(or,2);e(ar,{children:(b,C)=>{o();var f=No(),P=r(d(f));n(P,{m:"t"});var T=r(P,2);n(T,{m:"-t"});var J=r(T,2);n(J,{m:"(-1)^k"}),o(),a(b,f)}});var er=r(ar,2);n(er,{display:!0,m:`
      \\sum_{n=k}^{\\oo} \\stirlI{n}{k} \\frac{(-1)^{n-k} \\cdot t^n}{n!} = \\frac{1}{k!} (\\ln{(1 + t)})^k
      `});var tr=r(er,2);e(tr,{children:(b,C)=>{o();var f=Ho(),P=r(d(f));n(P,{m:"(\\ln{(1 + t)})^n / n!"}),o(),a(b,f)}});var dr=r(tr,2);n(dr,{display:!0,m:`
      (1 + t)^x = \\sum_{k=0}^{\\oo} x^k \\sum_{n=k}^{\\oo} \\stirlI{n}{k} \\frac{(-1)^{n-k} \\cdot t^n}{n!} =
      \\sum_{n=0}^{\\oo}\\sum_{k = 0}^{n} \\stirlI{n}{k} \\frac{(-1)^{n-k} \\cdot t^n}{n!} x^k =
      \\sum_{n=0}^{\\oo} \\frac{t^n}{n!} \\sum_{k = 0}^{n} \\stirlI{n}{k} (-1)^{n-k} \\cdot x^k
      `});var _r=r(dr,2);e(_r,{children:(b,C)=>{o();var f=So(),P=r(d(f));n(P,{m:"(1 + t)^x"});var T=r(P,2);n(T,{m:"t^n"});var J=r(T,2);n(J,{m:"t^n"});var V=r(J,2);n(V,{m:"n!"}),o(),a(b,f)}});var vr=r(_r,2);n(vr,{display:!0,m:`
      x^{\\underline{n}} = \\sum_{k=0}^{n} \\stirlI{n}{k} (-1)^{n-k} \\cdot x^k
      `}),a(S,h)}});var Cr=r(Ar,2);ir(Cr,{children:(S,W)=>{var h=Go(),R=d(h);e(R,{children:(G,x)=>{o();var I=u(`Связь между комбинаторикой и аналитической теорией чисел хорошо заметна тогда,
    когда в одном контексте появляются числа Стирлинга и дзета-функции Римана и Гурвица.`);a(G,I)}});var q=r(R,2);e(q,{children:(G,x)=>{o();var I=u("Отправной точкой служит тождество, которое связывает степени логарифма с числами Стирлинга первого рода.");a(G,I)}});var B=r(q,2);n(B,{display:!0,m:`
      \\frac{\\log^{m}(1+z)}{1+z} = m! \\sum_{k=0}^{\\oo} \\stirlI{k+1}{m+1} \\cdot  \\frac{1}{k!} z^{k} \\quad{где} \\ ~|z| < 1
      `});var z=r(B,2);e(z,{children:(G,x)=>{o();var I=u("С этими же числами связано равенство для дзета-функции Римана:");a(G,I)}});var N=r(z,2);n(N,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\cdot \\frac{1}{n\\,(n!)} = \\zeta(i+1) \\quad{где} \\ ~i = 1, 2, 3, \\dots
      `});var F=r(N,2);e(F,{children:(G,x)=>{o();var I=u(`Если заменить факториал на восходящую степень, то можно получить выражение для дзета-функции Гурвица,
    обобщающей дзета-функцию Римана.`);a(G,I)}});var j=r(F,2);n(j,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\cdot  \\frac{1}{n \\cdot v^{\\overline{n}}} =
      \\zeta(i+1, v) \\quad{где} \\ ~\\Re(v) > 0
      `}),a(S,h)}});var Jr=r(Cr,2);ir(Jr,{children:(S,W)=>{var h=Wo(),R=d(h);e(R,{children:(i,y)=>{o();var v=u("Их экспоненциальная производящая функция имеет вид:");a(i,v)}});var q=r(R,2);n(q,{display:!0,m:`
      \\sum_{n=k}^{\\oo} \\stirlI{n}{k} \\frac{z^n}{n!} = \\frac{(-1)^k}{k!} \\ln^{k}(1 - z) \\quad{где} \\ ~|z| < 1
      `});var B=r(q,2);e(B,{children:(i,y)=>{o();var v=u("Рассматриваем интересующую нас величину");a(i,v)}});var z=r(B,2);n(z,{display:!0,m:"S_i = \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\cdot \\frac{1}{n \\, n!}"});var N=r(z,2);e(N,{children:(i,y)=>{o();var v=Oo(),X=r(d(v));n(X,{m:"1/n"}),o(),a(i,v)}});var F=r(N,2);n(F,{display:!0,m:"\\frac{1}{n} = \\int_{0}^{1} x^{n-1} dx"});var j=r(F,2);e(j,{children:(i,y)=>{o();var v=u("Подставляя это представление в сумму, получаем");a(i,v)}});var G=r(j,2);n(G,{display:!0,m:`
      \\stirlI{n}{i} \\cdot \\frac{1}{n \\cdot n!} = \\stirlI{n}{i} \\cdot \\frac{1}{n!} \\cdot \\int_{0}^{1} x^{n-1} dx
      `});var x=r(G,2);e(x,{children:(i,y)=>{o();var v=Ro(),X=r(d(v));n(X,{m:"n"}),o(),a(i,v)}});var I=r(x,2);n(I,{display:!0,m:`
      S_i = \\int_{0}^{1} \\left( \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{x^{n-1}}{n!} \\right) dx
      `});var M=r(I,2);e(M,{children:(i,y)=>{o();var v=u("Преобразуем внутреннюю сумму. Из производящей функции следует");a(i,v)}});var K=r(M,2);n(K,{display:!0,m:"\\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{x^n}{n!} = \\frac{(-1)^i}{i!} \\ln^{i}(1 - x)"});var U=r(K,2);e(U,{children:(i,y)=>{o();var v=Fo(),X=r(d(v));n(X,{m:"x^{-1}"});var jr=r(X,2);n(jr,{m:"x \\in (0,1)"}),o(),a(i,v)}});var Z=r(U,2);n(Z,{display:!0,m:"\\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{x^{n-1}}{n!} = \\frac{(-1)^i}{i!} \\frac{\\ln^{i}(1 - x)}{x}"});var rr=r(Z,2);e(rr,{children:(i,y)=>{o();var v=u("Подставляя это выражение во внутреннюю сумму, получаем");a(i,v)}});var nr=r(rr,2);n(nr,{display:!0,m:"S_i = \\frac{(-1)^i}{i!} \\int_{0}^{1} \\frac{\\ln^{i}(1 - x)}{x} dx"});var or=r(nr,2);e(or,{children:(i,y)=>{o();var v=u("Это выражение является ключевым переходом: в правой части появляется интеграл, в котором уже угадывается структура дзета-функции.");a(i,v)}});var ar=r(or,2);e(ar,{children:(i,y)=>{o();var v=Do(),X=r(d(v));n(X,{m:"t = 1 - x"});var jr=r(X,2);n(jr,{m:"dt = -dx"}),o(),a(i,v)}});var er=r(ar,2);n(er,{display:!0,m:`
      \\int_{0}^{1} \\frac{\\ln^{i}(1 - x)}{x} dx = \\int_{1}^{0} \\frac{\\ln^{i}(t)}{1 - t} (-dt) =
      \\int_{0}^{1} \\frac{\\ln^{i}(t)}{1 - t} dt
      `});var tr=r(er,2);e(tr,{children:(i,y)=>{o();var v=Mo(),X=r(d(v));n(X,{m:"\\ln t < 0"});var jr=r(X,2);n(jr,{m:"(0,1)"}),o(),a(i,v)}});var dr=r(tr,2);n(dr,{display:!0,m:"(-1)^i \\ln^{i}(t) = (-\\ln t)^{i}"});var _r=r(dr,2);e(_r,{children:(i,y)=>{o();var v=To(),X=r(d(v));n(X,{m:"S_i"}),o(),a(i,v)}});var vr=r(_r,2);n(vr,{display:!0,m:"S_i = \\frac{1}{i!} \\int_{0}^{1} \\frac{(-\\ln t)^{i}}{1 - t} dt"});var b=r(vr,2);e(b,{children:(i,y)=>{o();var v=u("Теперь используем разложение в геометрический ряд");a(i,v)}});var C=r(b,2);n(C,{display:!0,m:"\\frac{1}{1 - t} = \\sum_{m=0}^{\\oo} t^{m} \\quad{где} \\ ~|t| < 1"});var f=r(C,2);e(f,{children:(i,y)=>{o();var v=u("и подставляем его в интеграл:");a(i,v)}});var P=r(f,2);n(P,{display:!0,m:"S_i = \\frac{1}{i!} \\sum_{m=0}^{\\oo} \\int_{0}^{1} t^{m} (-\\ln t)^{i} dt"});var T=r(P,2);e(T,{children:(i,y)=>{o();var v=wo(),X=r(d(v));n(X,{m:"t = e^{-u}"}),o(),a(i,v)}});var J=r(T,2);n(J,{display:!0,m:"\\int_{0}^{1} t^{m} (-\\ln t)^{i} dt = \\frac{i!}{(m+1)^{i+1}}"});var V=r(J,2);e(V,{children:(i,y)=>{o();var v=u("Подставляя это выражение, имеем");a(i,v)}});var mr=r(V,2);n(mr,{display:!0,m:`
      S_i = \\sum_{m=0}^{\\oo} \\frac{1}{(m+1)^{i+1}} = \\sum_{k=1}^{\\oo} \\frac{1}{k^{i+1}} = \\zeta(i+1)
      `});var sr=r(mr,2);e(sr,{children:(i,y)=>{o();var v=u("Тем самым получено окончательное тождество");a(i,v)}});var lr=r(sr,2);n(lr,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\cdot \\frac{1}{n \\cdot n!} = \\zeta(i+1) \\quad{где} \\ ~i = 1, 2, 3, \\dots
      `});var kr=r(lr,2);e(kr,{children:(i,y)=>{o();var v=u(`Это формула для дзета-функции Римона. Теперь наша цель — получить обобщение этой формулы для дзета-функции Гурвица.
    А именно, мы хотим доказать, что`);a(i,v)}});var cr=r(kr,2);n(cr,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\cdot \\frac{1}{n \\cdot v^{\\overline{n}}} = \\zeta(i+1, v) \\quad{где} \\ ~i = 1, 2, 3, \\dots, \\, \\Re(v) > 0
      `});var pr=r(cr,2);e(pr,{children:(i,y)=>{o();var v=u("Восходящую степень также можно записать через гамма-функцию:");a(i,v)}});var ur=r(pr,2);n(ur,{display:!0,m:`
      v^{\\overline{n}} = v (v+1) \\dots (v+n-1) = \\frac{\\Gamma(v+n)}{\\Gamma(v)}
      `});var $r=r(ur,2);e($r,{children:(i,y)=>{o();var v=u("А дзета-функция Гурвица определяется рядом");a(i,v)}});var fr=r($r,2);n(fr,{display:!0,m:`
      \\zeta(s, v) = \\sum_{m=0}^{\\oo} \\frac{1}{(m+v)^{s}} \\quad{где} \\ ~\\Re(s) > 1 \\ \\Re(v) > 0
      `});var Ir=r(fr,2);e(Ir,{children:(i,y)=>{o();var v=u("Из представления восходящей степени через гамма-функцию следует");a(i,v)}});var hr=r(Ir,2);n(hr,{display:!0,m:`
      \\frac{1}{v^{\\overline{n}}} = \\frac{\\Gamma(v)}{\\Gamma(v+n)}
      `});var xr=r(hr,2);e(xr,{children:(i,y)=>{o();var v=u("С другой стороны, бета-функция задаётся как");a(i,v)}});var Pr=r(xr,2);n(Pr,{display:!0,m:`
      B(v, n) = \\int_{0}^{1} t^{v-1} (1 - t)^{n-1} dt = \\frac{\\Gamma(v) \\cdot \\Gamma(n)}{\\Gamma(v+n)}
      `});var gr=r(Pr,2);e(gr,{children:(i,y)=>{o();var v=u("Отсюда получаем");a(i,v)}});var p=r(gr,2);n(p,{display:!0,m:`
      \\frac{\\Gamma(v)}{\\Gamma(v+n)} = \\frac{1}{(n-1)!} \\int_{0}^{1} t^{v-1} (1 - t)^{n-1} dt
      `});var H=r(p,2);e(H,{children:(i,y)=>{o();var v=u("Таким образом,");a(i,v)}});var k=r(H,2);n(k,{display:!0,m:`
      \\frac{1}{v^{\\overline{n}}} = \\frac{1}{(n-1)!} \\int_{0}^{1} t^{v-1} (1 - t)^{n-1} dt \\quad{где} \\ ~\\Re(v) > 0 \\ n \\ge 1
      `});var g=r(k,2);e(g,{children:(i,y)=>{o();var v=u("Рассмотрим обобщённую сумму");a(i,v)}});var L=r(g,2);n(L,{display:!0,m:"S_i(v) = \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\cdot \\frac{1}{n \\cdot v^{\\overline{n}}}"});var c=r(L,2);e(c,{children:(i,y)=>{o();var v=u("Используя формулу выше, имеем");a(i,v)}});var O=r(c,2);n(O,{display:!0,m:"\\frac{1}{n v^{\\overline{n}}} = \\frac{1}{n!} \\int_{0}^{1} t^{v-1} (1 - t)^{n-1} dt"});var t=r(O,2);e(t,{children:(i,y)=>{o();var v=u("Следовательно,");a(i,v)}});var l=r(t,2);n(l,{display:!0,m:`
      \\stirlI{n}{i} \\frac{1}{n v^{\\overline{n}}} = \\stirlI{n}{i} \\frac{1}{n!} \\int_{0}^{1} t^{v-1} (1 - t)^{n-1} dt
      `});var m=r(l,2);e(m,{children:(i,y)=>{o();var v=Ao(),X=r(d(v));n(X,{m:"n \\ge i"}),o(),a(i,v)}});var s=r(m,2);n(s,{display:!0,m:`
      S_i(v) = \\int_{0}^{1} t^{v-1} \\left( \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{(1 - t)^{n-1}}{n!} \\right) dt
      `});var $=r(s,2);e($,{children:(i,y)=>{o();var v=u("Внутренняя сумма связана с экспоненциальной производящей функцией чисел Стирлинга первого рода:");a(i,v)}});var E=r($,2);n(E,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{z^n}{n!} = \\frac{(-1)^i}{i!} \\ln^{i}(1 - z) \\quad{где} \\ ~|z| < 1
      `});var D=r(E,2);e(D,{children:(i,y)=>{o();var v=Co(),X=r(d(v));n(X,{m:"z = 1 - t"}),o(),a(i,v)}});var w=r(D,2);n(w,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{(1 - t)^n}{n!} = \\frac{(-1)^i}{i!} (\\ln{t} )^{i}
      `});var A=r(w,2);e(A,{children:(i,y)=>{o();var v=Jo(),X=r(d(v));n(X,{m:"(1 - t)^{-1}"}),o(),a(i,v)}});var Q=r(A,2);n(Q,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{(1 - t)^{n-1}}{n!} = \\frac{(-1)^i}{i!} \\cdot \\frac{(\\ln{t} )^{i}}{1 - t}
      `});var Y=r(Q,2);e(Y,{children:(i,y)=>{o();var v=u("Отсюда");a(i,v)}});var yr=r(Y,2);n(yr,{display:!0,m:`
      S_i(v) = \\frac{(-1)^i}{i!} \\int_{0}^{1} t^{v-1} \\frac{\\ln^{i}(t)}{1 - t} dt
      `});var br=r(yr,2);e(br,{children:(i,y)=>{o();var v=Ko(),X=r(d(v));n(X,{m:"(0,1)"});var jr=r(X,2);n(jr,{m:"(-1)^i \\ln^{i}(t) = (-\\ln t)^i"}),o(),a(i,v)}});var Er=r(br,2);n(Er,{display:!0,m:`
      S_i(v) = \\frac{1}{i!} \\int_{0}^{1} t^{v-1} \\frac{(-\\ln t)^i}{1 - t} dt
      `});var Xr=r(Er,2);e(Xr,{children:(i,y)=>{o();var v=Lo(),X=r(d(v));n(X,{m:"1 / (1 - t)"}),o(),a(i,v)}});var qr=r(Xr,2);n(qr,{display:!0,m:`
      S_i(v) = \\frac{1}{i!} \\sum_{m=0}^{\\oo} \\int_{0}^{1} t^{v-1+m} (-\\ln t)^i dt
      `});var zr=r(qr,2);e(zr,{children:(i,y)=>{o();var v=Qo(),X=r(d(v));n(X,{m:"t = e^{-u}"}),o(),a(i,v)}});var Ur=r(zr,2);n(Ur,{display:!0,m:`
      \\int_{0}^{1} t^{a-1} (-\\ln t)^i dt = \\frac{i!}{a^{i+1}}, \\quad{где} \\ ~\\Re(a) > 0
      `});var Vr=r(Ur,2);e(Vr,{children:(i,y)=>{o();var v=Uo(),X=r(d(v));n(X,{m:"a = v + m"}),o(),a(i,v)}});var Wr=r(Vr,2);n(Wr,{display:!0,m:"S_i(v) = \\sum_{m=0}^{\\oo} \\frac{1}{(v + m)^{i+1}}"});var Yr=r(Wr,2);e(Yr,{children:(i,y)=>{o();var v=u("По определению это и есть дзета-функция Гурвица:");a(i,v)}});var Zr=r(Yr,2);n(Zr,{display:!0,m:"\\sum_{m=0}^{\\oo} \\frac{1}{(v + m)^{i+1}} = \\zeta(i+1, v)"});var rn=r(Zr,2);e(rn,{children:(i,y)=>{o();var v=u("Объединяя результаты, получаем окончательное тождество");a(i,v)}});var nn=r(rn,2);n(nn,{display:!0,m:`
      \\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{1}{n \\cdot v^{\\overline{n}}} =
      \\zeta(i+1, v) \\quad{где} \\ ~i = 1, 2, 3, \\dots, \\ \\Re(v) > 0
      `});var on=r(nn,2);e(on,{children:(i,y)=>{o();var v=Vo(),X=r(d(v));n(X,{m:"v = 1"});var jr=r(X,2);n(jr,{m:"1^{\\overline{n}}= n!"}),o(),a(i,v)}});var _n=r(on,2);n(_n,{display:!0,m:"\\sum_{n=i}^{\\oo} \\stirlI{n}{i} \\frac{1}{n \\cdot n!} = \\zeta(i+1)"}),a(S,h)}});var Kr=r(Jr,2);Nr(Kr,{children:(S,W)=>{o();var h=u("Дополнительные тождества");a(S,h)}});var Lr=r(Kr,2);ir(Lr,{children:(S,W)=>{var h=na(),R=d(h);e(R,{children:(j,G)=>{o();var x=Yo(),I=r(d(x));n(I,{m:"x^n"});var M=r(I,2);n(M,{m:"x^{\\overline{n}}"});var K=r(M,2);n(K,{m:"x^{\\underline{n}}"});var U=r(K,2);n(U,{m:"x^n"}),o(),a(j,x)}});var q=r(R,2);n(q,{display:!0,m:`
      x^n = \\sum_k \\stirlII{n}{k}(-1)^{n-k} \\, x^{\\overline{k}} = \\sum_{k, m} \\stirlII{n}{k}\\stirlI{n}{m}(-1)^{n-k} \\, x^{m}
      `});var B=r(q,2);e(B,{children:(j,G)=>{o();var x=Zo(),I=r(d(x));n(I,{m:"x"});var M=r(I,2);n(M,{m:"x^0, x^1, x^2, \\dotsc , x^{n-1}, x^{n+1}, x^{n+2}"}),o(),a(j,x)}});var z=r(B,2);n(z,{display:!0,m:`
      \\sum_{k} \\stirlII{n}{k}\\stirlI{k}{m}(-1)^{n-k} = [m=n] \\quad{где} \\ ~n, m \\in \\NN_0
      `});var N=r(z,2);e(N,{children:(j,G)=>{o();var x=ra(),I=r(d(x));n(I,{m:"x^{\\overline{n}}"});var M=r(I,2);n(M,{m:"x^{\\overline{n}}"});var K=r(M,2);n(K,{m:"x^n"});var U=r(K,2);n(U,{m:"x^{\\overline{n}}"}),o(),a(j,x)}});var F=r(N,2);n(F,{display:!0,m:`
      x^{\\overline{n}} = \\sum_{k = 0}^{n} \\stirlI{n}{k} x^k =  \\sum_{k, m} \\stirlI{n}{k}\\stirlII{n}{m}(-1)^{n-k} \\, x^{\\overline{m}}
      `}),a(S,h)}});var Qr=r(Lr,2);ir(Qr,{children:(S,W)=>{var h=aa(),R=d(h);e(R,{children:(N,F)=>{o();var j=oa(),G=r(d(j));n(G,{m:"\\stirlI{n}{k}"});var x=r(G,2);n(x,{m:"\\stirlII{n}{k}"});var I=r(x,2);n(I,{m:"n"}),o(),a(N,j)}});var q=r(R,2);n(q,{display:!0,m:`\\align{
      \\stirlI{0}{k} &= \\stirlII{0}{k} = [k = 0] \\\\!!
      \\stirlI{n}{0} &= \\stirlII{n}{0} = [n = 0]
      }`});var B=r(q,2);e(B,{children:(N,F)=>{o();var j=u("Теперь числа Стирлинга первого и второго рода связывает простой закон:");a(N,j)}});var z=r(B,2);n(z,{display:!0,m:"\\stirlI{n}{k} = \\stirlII{-n}{-k} \\quad{где} \\ ~n, m \\in \\NN"}),a(S,h)}});var dn=r(Qr,2);Nr(dn,{children:(S,W)=>{o();var h=u("Числа Лаха");a(S,h)}}),a(tn,Hr)}export{ga as component};
